<a href="https://colab.research.google.com/github/gitmystuff/INFO4080/blob/main/Week_14-Wrap_Up/Week_14_In_Class_Activity.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Week 14: In-Class Activity

Your Name

## Getting Started

* Colab - get notebook from gitmystuff DTSC4080 repository
* Save a Copy in Drive
* Remove Copy of
* Edit your name
* Attendance
* Clean up Colab Notebooks folder
* Submit shared link

## SQL

### Public Data

* https://data.census.gov/
* https://healthdata.gov/
* Edgar: https://www.sec.gov/edgar
* Bureau of Justice: https://bjs.ojp.gov/
* IRS: https://www.irs.gov/statistics
* Bureau of Economic Analysis: https://www.bea.gov/
* Federal Reserve: https://www.federalreserve.gov/data.htm
* DOE Data and Research: https://www2.ed.gov/rschstat/landing.jhtml?src=ft
* Bureau of Labor Statistics: https://www.bls.gov/
* US Patent and Trademark Office: https://www.uspto.gov/
* National Centers for Environmental Information: https://www.ncei.noaa.gov/
* World Bank: https://data.worldbank.org/
* CIA World Factbook: https://www.cia.gov/the-world-factbook/
* United Nations: https://data.un.org/
* UNICEF: https://data.unicef.org/
* Statistics Canada: https://www.statcan.gc.ca/
* Eurostat: https://ec.europa.eu/eurostat
* Organization for Economic Cooperation and Development: https://data.oecd.org/
* UK National Health Service NHS Digital: https://digital.nhs.uk/
* Google Finance: https://www.google.com/finance/
* Google Trends: https://trends.google.com/trends/
* Google Public Data Explorer: https://www.google.com/publicdata/directory
* Amazon Web Services Public Data: https://registry.opendata.aws/
* Data.gov: https://data.gov/
* Google Ngram Viewer: https://books.google.com/ngrams/
* The Corpus of Contemporary American English: https://www.english-corpora.org/coca/
* University of California, Irvine, Center for Machine Learning: https://archive.ics.uci.edu/
* Pew Research Center: https://www.pewresearch.org/
* https://www.linkedin.com/learning/learning-public-data-sets-2/bureau-of-labor-statistics?resume=false&u=74650474

### BigQuery

* https://console.cloud.google.com/marketplace/product/google/bigquery.googleapis.com?_ga=2.211298837.1868925152.1707340152-1299486709.1704991752&project=studynotes-prod&returnUrl=%2Fbigquery%3F_ga%3D2.211298837.1868925152.1707340152-1299486709.1704991752%26project%3Dstudynotes-prod

<pre>
SELECT
  *
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
LIMIT 100
</pre>

<pre>
SELECT
  *
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
WHERE
  state = 'TX'
LIMIT 100
</pre>

<pre>
SELECT
  MIN(year), MAX(year)
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
</pre>

<pre>
SELECT
  name, COUNT(name) as cnt
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY cnt DESC
LIMIT 1
</pre>

<pre>
SELECT
  *
FROM
  `bigquery-public-data.usa_names.usa_1910_current`
WHERE
  state = 'TX'
AND
  year = 2020
LIMIT 100
</pre>

Public Datasets

* Add
* Search for public datasets
* Search of World Bank

World Bank
* https://databank.worldbank.org/metadataglossary/jobs/series/SI.POV.GINI

<pre>

SELECT acs.geo_id, acs.total_pop, fips.state_name
FROM
`bigquery-public-data.census_bureau_acs.state_2010_1yr` as acs,
`bigquery-public-data.census_utility.fips_codes_states` as fips
WHERE acs.geo_id = fips.state_fips_code
AND fips.state_name = 'Texas'

</pre>

<pre>
SELECT *
FROM `bigquery-public-data.census_bureau_acs.state_2010_1yr` as acs
INNER JOIN  `bigquery-public-data.census_utility.fips_codes_states` as fips
ON acs.geo_id = fips.state_fips_code
</pre>

### SQL Notebook

### Setting Up Databases

* https://www3.ntu.edu.sg/home/ehchua/programming/sql/SampleDatabases.html
* https://learnsql.com/blog/free-online-datasets-to-practice-sql/
* https://realpython.com/python-sql-libraries/

In [ ]:
import sqlite3
from sqlite3 import Error

def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [ ]:
connection = create_connection("sm_app.sqlite")

Connection to SQLite DB successful

In [ ]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [ ]:
create_users_table = """
CREATE TABLE IF NOT EXISTS users (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT NOT NULL,
  age INTEGER,
  gender TEXT,
  nationality TEXT
);
"""

create_posts_table = """
CREATE TABLE IF NOT EXISTS posts(
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  title TEXT NOT NULL,
  description TEXT NOT NULL,
  user_id INTEGER NOT NULL,
  FOREIGN KEY (user_id) REFERENCES users (id)
);
"""

create_comments_table = """
CREATE TABLE IF NOT EXISTS comments (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  text TEXT NOT NULL,
  user_id INTEGER NOT NULL,
  post_id INTEGER NOT NULL,
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

create_likes_table = """
CREATE TABLE IF NOT EXISTS likes (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  user_id INTEGER NOT NULL,
  post_id integer NOT NULL,
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

execute_query(connection, create_users_table)
execute_query(connection, create_posts_table)
execute_query(connection, create_comments_table)
execute_query(connection, create_likes_table)

Query executed successfully
Query executed successfully
Query executed successfully
Query executed successfully

### CRUD

In [ ]:
create_users = """
INSERT INTO
  users (name, age, gender, nationality)
VALUES
  ('James', 25, 'male', 'USA'),
  ('Leila', 32, 'female', 'France'),
  ('Brigitte', 35, 'female', 'England'),
  ('Mike', 40, 'male', 'Denmark'),
  ('Elizabeth', 21, 'female', 'Canada');
"""

execute_query(connection, create_users)

Query executed successfully

In [ ]:
create_posts = """
INSERT INTO
  posts (title, description, user_id)
VALUES
  ("Happy", "I am feeling very happy today", 1),
  ("Hot Weather", "The weather is very hot today", 2),
  ("Help", "I need some help with my work", 2),
  ("Great News", "I am getting married", 1),
  ("Interesting Game", "It was a fantastic game of tennis", 5),
  ("Party", "Anyone up for a late-night party today?", 3);
"""

execute_query(connection, create_posts)

Query executed successfully

In [ ]:
create_comments = """
INSERT INTO
  comments (text, user_id, post_id)
VALUES
  ('Count me in', 1, 6),
  ('What sort of help?', 5, 3),
  ('Congrats buddy', 2, 4),
  ('I was rooting for Nadal though', 4, 5),
  ('Help with your thesis?', 2, 3),
  ('Many congratulations', 5, 4);
"""

create_likes = """
INSERT INTO
  likes (user_id, post_id)
VALUES
  (1, 6),
  (2, 3),
  (1, 5),
  (5, 4),
  (2, 4),
  (4, 2),
  (3, 6);
"""

execute_query(connection, create_comments)
execute_query(connection, create_likes)

Query executed successfully
Query executed successfully

In [ ]:
def execute_read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as e:
        print(f"The error '{e}' occurred")

In [ ]:
select_users = "SELECT * from users"
users = execute_read_query(connection, select_users)

for user in users:
    print(user)

(1, 'James', 25, 'male', 'USA')
(2, 'Leila', 32, 'female', 'France')
(3, 'Brigitte', 35, 'female', 'England')
(4, 'Mike', 40, 'male', 'Denmark')
(5, 'Elizabeth', 21, 'female', 'Canada')

In [ ]:
select_posts = "SELECT * FROM posts"
posts = execute_read_query(connection, select_posts)

for post in posts:
    print(post)

(1, 'Happy', 'I am feeling very happy today', 1)
(2, 'Hot Weather', 'The weather is very hot today', 2)
(3, 'Help', 'I need some help with my work', 2)
(4, 'Great News', 'I am getting married', 1)
(5, 'Interesting Game', 'It was a fantastic game of tennis', 5)
(6, 'Party', 'Anyone up for a late-night party today?', 3)

In [ ]:
select_users_posts = """
SELECT
  users.id,
  users.name,
  posts.description
FROM
  posts
  INNER JOIN users ON users.id = posts.user_id
"""

users_posts = execute_read_query(connection, select_users_posts)

for users_post in users_posts:
    print(users_post)

(1, 'James', 'I am feeling very happy today')
(2, 'Leila', 'The weather is very hot today')
(2, 'Leila', 'I need some help with my work')
(1, 'James', 'I am getting married')
(5, 'Elizabeth', 'It was a fantastic game of tennis')
(3, 'Brigitte', 'Anyone up for a late-night party today?')

In [ ]:
select_posts_comments_users = """
SELECT
  posts.description as post,
  text as comment,
  name
FROM
  posts
  INNER JOIN comments ON posts.id = comments.post_id
  INNER JOIN users ON users.id = comments.user_id
"""

posts_comments_users = execute_read_query(
    connection, select_posts_comments_users
)

for posts_comments_user in posts_comments_users:
    print(posts_comments_user)

('Anyone up for a late-night party today?', 'Count me in', 'James')
('I need some help with my work', 'What sort of help?', 'Elizabeth')
('I am getting married', 'Congrats buddy', 'Leila')
('It was a fantastic game of tennis', 'I was rooting for Nadal though', 'Mike')
('I need some help with my work', 'Help with your thesis?', 'Leila')
('I am getting married', 'Many congratulations', 'Elizabeth')

In [ ]:
select_post_description = "SELECT description FROM posts WHERE id = 2"

post_description = execute_read_query(connection, select_post_description)

for description in post_description:
    print(description)

('The weather is very hot today',)

In [ ]:
update_post_description = """
UPDATE
  posts
SET
  description = "The weather has become pleasant now"
WHERE
  id = 2
"""

execute_query(connection, update_post_description)

Query executed successfully

In [ ]:
select_post_description = "SELECT description FROM posts WHERE id = 2"

post_description = execute_read_query(connection, select_post_description)

for description in post_description:
    print(description)

('The weather has become pleasant now',)

In [ ]:
select_posts = "SELECT * FROM comments"
posts = execute_read_query(connection, select_posts)

for post in posts:
    print(post)

(1, 'Count me in', 1, 6)
(2, 'What sort of help?', 5, 3)
(3, 'Congrats buddy', 2, 4)
(4, 'I was rooting for Nadal though', 4, 5)
(5, 'Help with your thesis?', 2, 3)
(6, 'Many congratulations', 5, 4)

In [ ]:
delete_comment = "DELETE FROM comments WHERE id = 5"
execute_query(connection, delete_comment)

Query executed successfully

In [ ]:
select_posts = "SELECT * FROM comments"
posts = execute_read_query(connection, select_posts)

for post in posts:
    print(post)

(1, 'Count me in', 1, 6)
(2, 'What sort of help?', 5, 3)
(3, 'Congrats buddy', 2, 4)
(4, 'I was rooting for Nadal though', 4, 5)
(6, 'Many congratulations', 5, 4)

### Aggregate Functions

* Aggregate Functions -  https://www.simplilearn.com/tutorials/sql-tutorial/sql-aggregate-functions

In [ ]:
select_posts = "SELECT MIN(post_id), MAX(user_id) FROM comments"
agg = execute_read_query(connection, select_posts)

agg

[(3, 5)]

### MySQL to SQLite

* https://www3.ntu.edu.sg/home/ehchua/programming/sql/SampleDatabases.html
* https://dev.mysql.com/doc/employee/en/employees-installation.html
* https://github.com/datacharmer/test_db
* https://dev.mysql.com/doc/employee/en/sakila-structure.html

In [ ]:
# load sql and use sqlite as our database
%load_ext sql
%sql sqlite://

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS employees (
    emp_no      INT             NOT NULL,
    birth_date  DATE            NOT NULL,
    first_name  VARCHAR(14)     NOT NULL,
    last_name   VARCHAR(16)     NOT NULL,
    gender      CHAR(4)         NOT NULL,
    hire_date   DATE            NOT NULL,
    PRIMARY KEY (emp_no)
);

CREATE TABLE IF NOT EXISTS departments (
    dept_no     CHAR(4)         NOT NULL,
    dept_name   VARCHAR(40)     NOT NULL,
    PRIMARY KEY (dept_no)
);

CREATE TABLE IF NOT EXISTS dept_manager (
   emp_no       INT             NOT NULL,
   dept_no      CHAR(4)         NOT NULL,
   from_date    DATE            NOT NULL,
   to_date      DATE            NOT NULL,
   FOREIGN KEY (emp_no)  REFERENCES employees (emp_no)    ON DELETE CASCADE,
   FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,
   PRIMARY KEY (emp_no,dept_no)
);

CREATE TABLE IF NOT EXISTS dept_emp (
    emp_no      INT             NOT NULL,
    dept_no     CHAR(4)         NOT NULL,
    from_date   DATE            NOT NULL,
    to_date     DATE            NOT NULL,
    FOREIGN KEY (emp_no)  REFERENCES employees   (emp_no)  ON DELETE CASCADE,
    FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,
    PRIMARY KEY (emp_no,dept_no)
);

CREATE TABLE IF NOT EXISTS titles (
    emp_no      INT             NOT NULL,
    title       VARCHAR(50)     NOT NULL,
    from_date   DATE            NOT NULL,
    to_date     DATE,
    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,
    PRIMARY KEY (emp_no,title, from_date)
)
;

CREATE TABLE IF NOT EXISTS salaries (
    emp_no      INT             NOT NULL,
    salary      INT             NOT NULL,
    from_date   DATE            NOT NULL,
    to_date     DATE            NOT NULL,
    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,
    PRIMARY KEY (emp_no, from_date)
)
;

CREATE VIEW IF NOT EXISTS dept_emp_latest_date AS
    SELECT emp_no, MAX(from_date) AS from_date, MAX(to_date) AS to_date
    FROM dept_emp
    GROUP BY emp_no;

CREATE VIEW IF NOT EXISTS current_dept_emp AS
    SELECT l.emp_no, dept_no, l.from_date, l.to_date
    FROM dept_emp d
        INNER JOIN dept_emp_latest_date l
        ON d.emp_no=l.emp_no AND d.from_date=l.from_date AND l.to_date = d.to_date;

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql
SELECT * FROM sqlite_master;

 * sqlite://
Done.

[('table', 'employees', 'employees', 2, 'CREATE TABLE employees (\n    emp_no      INT             NOT NULL,\n    birth_date  DATE            NOT NULL,\n    first_name  VARCHAR(14)     NOT N ... (13 characters truncated) ... t_name   VARCHAR(16)     NOT NULL,\n    gender      CHAR(4)         NOT NULL,\n    hire_date   DATE            NOT NULL,\n    PRIMARY KEY (emp_no)\n)'),
 ('index', 'sqlite_autoindex_employees_1', 'employees', 3, None),
 ('table', 'departments', 'departments', 4, 'CREATE TABLE departments (\n    dept_no     CHAR(4)         NOT NULL,\n    dept_name   VARCHAR(40)     NOT NULL,\n    PRIMARY KEY (dept_no)\n)'),
 ('index', 'sqlite_autoindex_departments_1', 'departments', 5, None),
 ('table', 'dept_manager', 'dept_manager', 6, 'CREATE TABLE dept_manager (\n   emp_no       INT             NOT NULL,\n   dept_no      CHAR(4)         NOT NULL,\n   from_date    DATE            NO ... (93 characters truncated) ... yees (emp_no)    ON DELETE CASCADE,\n   FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,\n   PRIMARY KEY (emp_no,dept_no)\n)'),
 ('index', 'sqlite_autoindex_dept_manager_1', 'dept_manager', 7, None),
 ('table', 'dept_emp', 'dept_emp', 8, 'CREATE TABLE dept_emp (\n    emp_no      INT             NOT NULL,\n    dept_no     CHAR(4)         NOT NULL,\n    from_date   DATE            NOT NU ... (92 characters truncated) ... es   (emp_no)  ON DELETE CASCADE,\n    FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,\n    PRIMARY KEY (emp_no,dept_no)\n)'),
 ('index', 'sqlite_autoindex_dept_emp_1', 'dept_emp', 9, None),
 ('table', 'titles', 'titles', 10, 'CREATE TABLE titles (\n    emp_no      INT             NOT NULL,\n    title       VARCHAR(50)     NOT NULL,\n    from_date   DATE            NOT NULL,\n    to_date     DATE,\n    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,\n    PRIMARY KEY (emp_no,title, from_date)\n)'),
 ('index', 'sqlite_autoindex_titles_1', 'titles', 11, None),
 ('table', 'salaries', 'salaries', 12, 'CREATE TABLE salaries (\n    emp_no      INT             NOT NULL,\n    salary      INT             NOT NULL,\n    from_date   DATE            NOT NU ... (12 characters truncated) ... date     DATE            NOT NULL,\n    FOREIGN KEY (emp_no) REFERENCES employees (emp_no) ON DELETE CASCADE,\n    PRIMARY KEY (emp_no, from_date)\n)'),
 ('index', 'sqlite_autoindex_salaries_1', 'salaries', 13, None),
 ('view', 'dept_emp_latest_date', 'dept_emp_latest_date', 0, 'CREATE VIEW dept_emp_latest_date AS\n    SELECT emp_no, MAX(from_date) AS from_date, MAX(to_date) AS to_date\n    FROM dept_emp\n    GROUP BY emp_no'),
 ('view', 'current_dept_emp', 'current_dept_emp', 0, 'CREATE VIEW current_dept_emp AS\n    SELECT l.emp_no, dept_no, l.from_date, l.to_date\n    FROM dept_emp d\n        INNER JOIN dept_emp_latest_date l\n        ON d.emp_no=l.emp_no AND d.from_date=l.from_date AND l.to_date = d.to_date')]

In [ ]:
%%sql
INSERT INTO `employees` VALUES (10001,'1953-09-02','Georgi','Facello','M','1986-06-26'),
(10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21'),
(10003,'1959-12-03','Parto','Bamford','M','1986-08-28'),
(10004,'1954-05-01','Chirstian','Koblick','M','1986-12-01'),
(10005,'1955-01-21','Kyoichi','Maliniak','M','1989-09-12'),
(10006,'1953-04-20','Anneke','Preusig','F','1989-06-02'),
(10007,'1957-05-23','Tzvetan','Zielinski','F','1989-02-10'),
(10008,'1958-02-19','Saniya','Kalloufi','M','1994-09-15'),
(10009,'1952-04-19','Sumant','Peac','F','1985-02-18'),
(10010,'1963-06-01','Duangkaew','Piveteau','F','1989-08-24'),
(10011,'1953-11-07','Mary','Sluis','F','1990-01-22'),
(10012,'1960-10-04','Patricio','Bridgland','M','1992-12-18'),
(10013,'1963-06-07','Eberhardt','Terkki','M','1985-10-20'),
(10014,'1956-02-12','Berni','Genin','M','1987-03-11'),
(10015,'1959-08-19','Guoxiang','Nooteboom','M','1987-07-02'),
(10016,'1961-05-02','Kazuhito','Cappelletti','M','1995-01-27'),
(10017,'1958-07-06','Cristinel','Bouloucos','F','1993-08-03'),
(10018,'1954-06-19','Kazuhide','Peha','F','1987-04-03'),
(10019,'1953-01-23','Lillian','Haddadi','M','1999-04-30'),
(10020,'1952-12-24','Mayuko','Warwick','M','1991-01-26'),
(10021,'1960-02-20','Ramzi','Erde','M','1988-02-10'),
(10022,'1952-07-08','Shahaf','Famili','M','1995-08-22'),
(10023,'1953-09-29','Bojan','Montemayor','F','1989-12-17'),
(10024,'1958-09-05','Suzette','Pettey','F','1997-05-19'),
(10025,'1958-10-31','Prasadram','Heyers','M','1987-08-17'),
(10026,'1953-04-03','Yongqiao','Berztiss','M','1995-03-20'),
(10027,'1962-07-10','Divier','Reistad','F','1989-07-07'),
(10028,'1963-11-26','Domenick','Tempesti','M','1991-10-22'),
(10029,'1956-12-13','Otmar','Herbst','M','1985-11-20'),
(10030,'1958-07-14','Elvis','Demeyer','M','1994-02-17'),
(10031,'1959-01-27','Karsten','Joslin','M','1991-09-01'),
(10032,'1960-08-09','Jeong','Reistad','F','1990-06-20'),
(10033,'1956-11-14','Arif','Merlo','M','1987-03-18'),
(10034,'1962-12-29','Bader','Swan','M','1988-09-21'),
(10035,'1953-02-08','Alain','Chappelet','M','1988-09-05'),
(10036,'1959-08-10','Adamantios','Portugali','M','1992-01-03');

 * sqlite://
36 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM employees LIMIT 5;

 * sqlite://
Done.

[(10001, '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26'),
 (10002, '1964-06-02', 'Bezalel', 'Simmel', 'F', '1985-11-21'),
 (10003, '1959-12-03', 'Parto', 'Bamford', 'M', '1986-08-28'),
 (10004, '1954-05-01', 'Chirstian', 'Koblick', 'M', '1986-12-01'),
 (10005, '1955-01-21', 'Kyoichi', 'Maliniak', 'M', '1989-09-12')]

In [ ]:
%%sql
INSERT INTO `dept_emp` VALUES (10001,'d005','1986-06-26','9999-01-01'),
(10002,'d007','1996-08-03','9999-01-01'),
(10003,'d004','1995-12-03','9999-01-01'),
(10004,'d004','1986-12-01','9999-01-01'),
(10005,'d003','1989-09-12','9999-01-01'),
(10006,'d005','1990-08-05','9999-01-01'),
(10007,'d008','1989-02-10','9999-01-01'),
(10008,'d005','1998-03-11','2000-07-31'),
(10009,'d006','1985-02-18','9999-01-01'),
(10010,'d004','1996-11-24','2000-06-26'),
(10010,'d006','2000-06-26','9999-01-01'),
(10011,'d009','1990-01-22','1996-11-09'),
(10012,'d005','1992-12-18','9999-01-01'),
(10013,'d003','1985-10-20','9999-01-01'),
(10014,'d005','1993-12-29','9999-01-01'),
(10015,'d008','1992-09-19','1993-08-22'),
(10016,'d007','1998-02-11','9999-01-01'),
(10017,'d001','1993-08-03','9999-01-01'),
(10018,'d004','1992-07-29','9999-01-01'),
(10018,'d005','1987-04-03','1992-07-29'),
(10019,'d008','1999-04-30','9999-01-01'),
(10020,'d004','1997-12-30','9999-01-01'),
(10021,'d005','1988-02-10','2002-07-15'),
(10022,'d005','1999-09-03','9999-01-01'),
(10023,'d005','1999-09-27','9999-01-01'),
(10024,'d004','1998-06-14','9999-01-01'),
(10025,'d005','1987-08-17','1997-10-15'),
(10026,'d004','1995-03-20','9999-01-01'),
(10027,'d005','1995-04-02','9999-01-01'),
(10028,'d005','1991-10-22','1998-04-06'),
(10029,'d004','1991-09-18','1999-07-08'),
(10029,'d006','1999-07-08','9999-01-01'),
(10030,'d004','1994-02-17','9999-01-01'),
(10031,'d005','1991-09-01','9999-01-01'),
(10032,'d004','1990-06-20','9999-01-01'),
(10033,'d006','1987-03-18','1993-03-24'),
(10034,'d007','1995-04-12','1999-10-31'),
(10035,'d004','1988-09-05','9999-01-01'),
(10036,'d003','1992-04-28','9999-01-01');

 * sqlite://
39 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM dept_emp LIMIT 5;

 * sqlite://
Done.

[(10001, 'd005', '1986-06-26', '9999-01-01'),
 (10002, 'd007', '1996-08-03', '9999-01-01'),
 (10003, 'd004', '1995-12-03', '9999-01-01'),
 (10004, 'd004', '1986-12-01', '9999-01-01'),
 (10005, 'd003', '1989-09-12', '9999-01-01')]

In [ ]:
%%sql
INSERT INTO `departments` VALUES
('d001','Marketing'),
('d002','Finance'),
('d003','Human Resources'),
('d004','Production'),
('d005','Development'),
('d006','Quality Management'),
('d007','Sales'),
('d008','Research'),
('d009','Customer Service');

 * sqlite://
9 rows affected.

[]

In [ ]:
%%sql
INSERT INTO `salaries` VALUES (10001,60117,'1986-06-26','1987-06-26'),
(10001,62102,'1987-06-26','1988-06-25'),
(10001,66074,'1988-06-25','1989-06-25'),
(10001,66596,'1989-06-25','1990-06-25'),
(10001,66961,'1990-06-25','1991-06-25'),
(10001,71046,'1991-06-25','1992-06-24'),
(10001,74333,'1992-06-24','1993-06-24'),
(10001,75286,'1993-06-24','1994-06-24'),
(10001,75994,'1994-06-24','1995-06-24'),
(10001,76884,'1995-06-24','1996-06-23'),
(10001,80013,'1996-06-23','1997-06-23'),
(10001,81025,'1997-06-23','1998-06-23'),
(10001,81097,'1998-06-23','1999-06-23'),
(10001,84917,'1999-06-23','2000-06-22'),
(10001,85112,'2000-06-22','2001-06-22'),
(10001,85097,'2001-06-22','2002-06-22'),
(10001,88958,'2002-06-22','9999-01-01'),
(10002,65828,'1996-08-03','1997-08-03'),
(10002,65909,'1997-08-03','1998-08-03'),
(10002,67534,'1998-08-03','1999-08-03'),
(10002,69366,'1999-08-03','2000-08-02'),
(10002,71963,'2000-08-02','2001-08-02'),
(10002,72527,'2001-08-02','9999-01-01'),
(10003,40006,'1995-12-03','1996-12-02'),
(10003,43616,'1996-12-02','1997-12-02'),
(10003,43466,'1997-12-02','1998-12-02'),
(10003,43636,'1998-12-02','1999-12-02'),
(10003,43478,'1999-12-02','2000-12-01'),
(10003,43699,'2000-12-01','2001-12-01'),
(10003,43311,'2001-12-01','9999-01-01'),
(10004,40054,'1986-12-01','1987-12-01'),
(10004,42283,'1987-12-01','1988-11-30'),
(10004,42542,'1988-11-30','1989-11-30'),
(10004,46065,'1989-11-30','1990-11-30'),
(10004,48271,'1990-11-30','1991-11-30'),
(10004,50594,'1991-11-30','1992-11-29'),
(10004,52119,'1992-11-29','1993-11-29'),
(10004,54693,'1993-11-29','1994-11-29'),
(10004,58326,'1994-11-29','1995-11-29'),
(10004,60770,'1995-11-29','1996-11-28'),
(10004,62566,'1996-11-28','1997-11-28'),
(10004,64340,'1997-11-28','1998-11-28'),
(10004,67096,'1998-11-28','1999-11-28'),
(10004,69722,'1999-11-28','2000-11-27'),
(10004,70698,'2000-11-27','2001-11-27'),
(10004,74057,'2001-11-27','9999-01-01'),
(10005,78228,'1989-09-12','1990-09-12'),
(10005,82621,'1990-09-12','1991-09-12'),
(10005,83735,'1991-09-12','1992-09-11'),
(10005,85572,'1992-09-11','1993-09-11'),
(10005,85076,'1993-09-11','1994-09-11'),
(10005,86050,'1994-09-11','1995-09-11'),
(10005,88448,'1995-09-11','1996-09-10'),
(10005,88063,'1996-09-10','1997-09-10'),
(10005,89724,'1997-09-10','1998-09-10'),
(10005,90392,'1998-09-10','1999-09-10'),
(10005,90531,'1999-09-10','2000-09-09'),
(10005,91453,'2000-09-09','2001-09-09'),
(10005,94692,'2001-09-09','9999-01-01'),
(10006,40000,'1990-08-05','1991-08-05'),
(10006,42085,'1991-08-05','1992-08-04'),
(10006,42629,'1992-08-04','1993-08-04'),
(10006,45844,'1993-08-04','1994-08-04'),
(10006,47518,'1994-08-04','1995-08-04'),
(10006,47917,'1995-08-04','1996-08-03'),
(10006,52255,'1996-08-03','1997-08-03'),
(10006,53747,'1997-08-03','1998-08-03'),
(10006,56032,'1998-08-03','1999-08-03'),
(10006,58299,'1999-08-03','2000-08-02'),
(10006,60098,'2000-08-02','2001-08-02'),
(10006,59755,'2001-08-02','9999-01-01'),
(10007,56724,'1989-02-10','1990-02-10'),
(10007,60740,'1990-02-10','1991-02-10'),
(10007,62745,'1991-02-10','1992-02-10'),
(10007,63475,'1992-02-10','1993-02-09'),
(10007,63208,'1993-02-09','1994-02-09'),
(10007,64563,'1994-02-09','1995-02-09'),
(10007,68833,'1995-02-09','1996-02-09'),
(10007,70220,'1996-02-09','1997-02-08'),
(10007,73362,'1997-02-08','1998-02-08'),
(10007,75582,'1998-02-08','1999-02-08'),
(10007,79513,'1999-02-08','2000-02-08'),
(10007,80083,'2000-02-08','2001-02-07'),
(10007,84456,'2001-02-07','2002-02-07'),
(10007,88070,'2002-02-07','9999-01-01'),
(10008,46671,'1998-03-11','1999-03-11'),
(10008,48584,'1999-03-11','2000-03-10'),
(10008,52668,'2000-03-10','2000-07-31'),
(10009,60929,'1985-02-18','1986-02-18'),
(10009,64604,'1986-02-18','1987-02-18'),
(10009,64780,'1987-02-18','1988-02-18'),
(10009,66302,'1988-02-18','1989-02-17'),
(10009,69042,'1989-02-17','1990-02-17'),
(10009,70889,'1990-02-17','1991-02-17'),
(10009,71434,'1991-02-17','1992-02-17'),
(10009,74612,'1992-02-17','1993-02-16'),
(10009,76518,'1993-02-16','1994-02-16'),
(10009,78335,'1994-02-16','1995-02-16'),
(10009,80944,'1995-02-16','1996-02-16'),
(10009,82507,'1996-02-16','1997-02-15'),
(10009,85875,'1997-02-15','1998-02-15'),
(10009,89324,'1998-02-15','1999-02-15'),
(10009,90668,'1999-02-15','2000-02-15'),
(10009,93507,'2000-02-15','2001-02-14'),
(10009,94443,'2001-02-14','2002-02-14'),
(10009,94409,'2002-02-14','9999-01-01'),
(10010,72488,'1996-11-24','1997-11-24'),
(10010,74347,'1997-11-24','1998-11-24'),
(10010,75405,'1998-11-24','1999-11-24'),
(10010,78194,'1999-11-24','2000-11-23'),
(10010,79580,'2000-11-23','2001-11-23'),
(10010,80324,'2001-11-23','9999-01-01'),
(10011,42365,'1990-01-22','1991-01-22'),
(10011,44200,'1991-01-22','1992-01-22'),
(10011,48214,'1992-01-22','1993-01-21'),
(10011,50927,'1993-01-21','1994-01-21'),
(10011,51470,'1994-01-21','1995-01-21'),
(10011,54545,'1995-01-21','1996-01-21'),
(10011,56753,'1996-01-21','1996-11-09'),
(10012,40000,'1992-12-18','1993-12-18'),
(10012,41867,'1993-12-18','1994-12-18'),
(10012,42318,'1994-12-18','1995-12-18'),
(10012,44195,'1995-12-18','1996-12-17'),
(10012,46460,'1996-12-17','1997-12-17'),
(10012,46485,'1997-12-17','1998-12-17'),
(10012,47364,'1998-12-17','1999-12-17'),
(10012,51122,'1999-12-17','2000-12-16'),
(10012,54794,'2000-12-16','2001-12-16'),
(10012,54423,'2001-12-16','9999-01-01'),
(10013,40000,'1985-10-20','1986-10-20'),
(10013,40623,'1986-10-20','1987-10-20'),
(10013,40561,'1987-10-20','1988-10-19'),
(10013,40306,'1988-10-19','1989-10-19'),
(10013,43569,'1989-10-19','1990-10-19'),
(10013,46305,'1990-10-19','1991-10-19'),
(10013,47118,'1991-10-19','1992-10-18'),
(10013,50351,'1992-10-18','1993-10-18'),
(10013,49887,'1993-10-18','1994-10-18'),
(10013,53957,'1994-10-18','1995-10-18'),
(10013,57590,'1995-10-18','1996-10-17'),
(10013,59228,'1996-10-17','1997-10-17'),
(10013,59571,'1997-10-17','1998-10-17'),
(10013,63274,'1998-10-17','1999-10-17'),
(10013,63352,'1999-10-17','2000-10-16'),
(10013,66744,'2000-10-16','2001-10-16'),
(10013,68901,'2001-10-16','9999-01-01'),
(10014,46168,'1993-12-29','1994-12-29'),
(10014,48242,'1994-12-29','1995-12-29'),
(10014,47921,'1995-12-29','1996-12-28'),
(10014,50715,'1996-12-28','1997-12-28'),
(10014,53228,'1997-12-28','1998-12-28'),
(10014,53962,'1998-12-28','1999-12-28'),
(10014,56937,'1999-12-28','2000-12-27'),
(10014,59142,'2000-12-27','2001-12-27'),
(10014,60598,'2001-12-27','9999-01-01'),
(10015,40000,'1992-09-19','1993-08-22'),
(10016,70889,'1998-02-11','1999-02-11'),
(10016,72946,'1999-02-11','2000-02-11'),
(10016,76826,'2000-02-11','2001-02-10'),
(10016,76381,'2001-02-10','2002-02-10'),
(10016,77935,'2002-02-10','9999-01-01'),
(10017,71380,'1993-08-03','1994-08-03'),
(10017,75538,'1994-08-03','1995-08-03'),
(10017,79510,'1995-08-03','1996-08-02'),
(10017,82163,'1996-08-02','1997-08-02'),
(10017,86157,'1997-08-02','1998-08-02'),
(10017,89619,'1998-08-02','1999-08-02'),
(10017,91985,'1999-08-02','2000-08-01'),
(10017,96122,'2000-08-01','2001-08-01'),
(10017,98522,'2001-08-01','2002-08-01'),
(10017,99651,'2002-08-01','9999-01-01'),
(10018,55881,'1987-04-03','1988-04-02'),
(10018,59206,'1988-04-02','1989-04-02'),
(10018,61361,'1989-04-02','1990-04-02'),
(10018,61648,'1990-04-02','1991-04-02'),
(10018,61217,'1991-04-02','1992-04-01'),
(10018,61244,'1992-04-01','1993-04-01'),
(10018,63286,'1993-04-01','1994-04-01'),
(10018,65739,'1994-04-01','1995-04-01'),
(10018,67519,'1995-04-01','1996-03-31'),
(10018,69276,'1996-03-31','1997-03-31'),
(10018,72585,'1997-03-31','1998-03-31'),
(10018,72804,'1998-03-31','1999-03-31'),
(10018,76957,'1999-03-31','2000-03-30'),
(10018,80305,'2000-03-30','2001-03-30'),
(10018,84541,'2001-03-30','2002-03-30'),
(10018,84672,'2002-03-30','9999-01-01'),
(10019,44276,'1999-04-30','2000-04-29'),
(10019,46946,'2000-04-29','2001-04-29'),
(10019,46775,'2001-04-29','2002-04-29'),
(10019,50032,'2002-04-29','9999-01-01'),
(10020,40000,'1997-12-30','1998-12-30'),
(10020,40647,'1998-12-30','1999-12-30'),
(10020,43800,'1999-12-30','2000-12-29'),
(10020,44927,'2000-12-29','2001-12-29'),
(10020,47017,'2001-12-29','9999-01-01'),
(10021,55025,'1988-02-10','1989-02-09'),
(10021,56399,'1989-02-09','1990-02-09'),
(10021,59700,'1990-02-09','1991-02-09'),
(10021,60851,'1991-02-09','1992-02-09'),
(10021,61117,'1992-02-09','1993-02-08'),
(10021,60708,'1993-02-08','1994-02-08'),
(10021,63514,'1994-02-08','1995-02-08'),
(10021,66249,'1995-02-08','1996-02-08'),
(10021,70570,'1996-02-08','1997-02-07'),
(10021,74759,'1997-02-07','1998-02-07'),
(10021,77519,'1998-02-07','1999-02-07'),
(10021,77237,'1999-02-07','2000-02-07'),
(10021,79631,'2000-02-07','2001-02-06'),
(10021,82295,'2001-02-06','2002-02-06'),
(10021,84169,'2002-02-06','2002-07-15'),
(10022,40000,'1999-09-03','2000-09-02'),
(10022,39935,'2000-09-02','2001-09-02'),
(10022,41348,'2001-09-02','9999-01-01'),
(10023,47883,'1999-09-27','2000-09-26'),
(10023,50319,'2000-09-26','2001-09-26'),
(10023,50113,'2001-09-26','9999-01-01'),
(10024,83733,'1998-06-14','1999-06-14'),
(10024,86715,'1999-06-14','2000-06-13'),
(10024,91067,'2000-06-13','2001-06-13'),
(10024,94701,'2001-06-13','2002-06-13'),
(10024,96646,'2002-06-13','9999-01-01'),
(10025,40000,'1987-08-17','1988-08-16'),
(10025,44416,'1988-08-16','1989-08-16'),
(10025,48680,'1989-08-16','1990-08-16'),
(10025,50120,'1990-08-16','1991-08-16'),
(10025,50980,'1991-08-16','1992-08-15'),
(10025,54459,'1992-08-15','1993-08-15'),
(10025,54395,'1993-08-15','1994-08-15'),
(10025,56643,'1994-08-15','1995-08-15'),
(10025,57585,'1995-08-15','1996-08-14'),
(10025,57110,'1996-08-14','1997-08-14'),
(10025,57157,'1997-08-14','1997-10-15'),
(10026,47585,'1995-03-20','1996-03-19'),
(10026,51730,'1996-03-19','1997-03-19'),
(10026,53682,'1997-03-19','1998-03-19'),
(10026,56769,'1998-03-19','1999-03-19'),
(10026,60397,'1999-03-19','2000-03-18'),
(10026,64132,'2000-03-18','2001-03-18'),
(10026,65415,'2001-03-18','2002-03-18'),
(10026,66313,'2002-03-18','9999-01-01'),
(10027,40000,'1995-04-02','1996-04-01'),
(10027,39520,'1996-04-01','1997-04-01'),
(10027,42382,'1997-04-01','1998-04-01'),
(10027,43654,'1998-04-01','1999-04-01'),
(10027,43925,'1999-04-01','2000-03-31'),
(10027,45157,'2000-03-31','2001-03-31'),
(10027,45771,'2001-03-31','2002-03-31'),
(10027,46145,'2002-03-31','9999-01-01'),
(10028,48859,'1991-10-22','1992-10-21'),
(10028,50805,'1992-10-21','1993-10-21'),
(10028,52082,'1993-10-21','1994-10-21'),
(10028,54949,'1994-10-21','1995-10-21'),
(10028,55963,'1995-10-21','1996-10-20'),
(10028,57831,'1996-10-20','1997-10-20'),
(10028,58502,'1997-10-20','1998-04-06'),
(10029,63163,'1991-09-18','1992-09-17'),
(10029,66877,'1992-09-17','1993-09-17'),
(10029,69211,'1993-09-17','1994-09-17'),
(10029,70624,'1994-09-17','1995-09-17'),
(10029,70294,'1995-09-17','1996-09-16'),
(10029,70671,'1996-09-16','1997-09-16'),
(10029,73510,'1997-09-16','1998-09-16'),
(10029,75773,'1998-09-16','1999-09-16'),
(10029,76067,'1999-09-16','2000-09-15'),
(10029,76608,'2000-09-15','2001-09-15'),
(10029,77777,'2001-09-15','9999-01-01'),
(10030,66956,'1994-02-17','1995-02-17'),
(10030,68393,'1995-02-17','1996-02-17'),
(10030,72795,'1996-02-17','1997-02-16'),
(10030,76453,'1997-02-16','1998-02-16'),
(10030,79290,'1998-02-16','1999-02-16'),
(10030,83327,'1999-02-16','2000-02-16'),
(10030,86634,'2000-02-16','2001-02-15'),
(10030,87027,'2001-02-15','2002-02-15'),
(10030,88806,'2002-02-15','9999-01-01'),
(10031,40000,'1991-09-01','1992-08-31'),
(10031,40859,'1992-08-31','1993-08-31'),
(10031,41881,'1993-08-31','1994-08-31'),
(10031,44191,'1994-08-31','1995-08-31'),
(10031,47202,'1995-08-31','1996-08-30'),
(10031,47606,'1996-08-30','1997-08-30'),
(10031,50810,'1997-08-30','1998-08-30'),
(10031,52675,'1998-08-30','1999-08-30'),
(10031,54177,'1999-08-30','2000-08-29'),
(10031,53873,'2000-08-29','2001-08-29'),
(10031,56689,'2001-08-29','9999-01-01'),
(10032,48426,'1990-06-20','1991-06-20'),
(10032,49389,'1991-06-20','1992-06-19'),
(10032,52000,'1992-06-19','1993-06-19'),
(10032,53038,'1993-06-19','1994-06-19'),
(10032,54336,'1994-06-19','1995-06-19'),
(10032,53978,'1995-06-19','1996-06-18'),
(10032,55090,'1996-06-18','1997-06-18'),
(10032,57110,'1997-06-18','1998-06-18'),
(10032,57926,'1998-06-18','1999-06-18'),
(10032,57876,'1999-06-18','2000-06-17'),
(10032,61709,'2000-06-17','2001-06-17'),
(10032,65820,'2001-06-17','2002-06-17'),
(10032,69539,'2002-06-17','9999-01-01'),
(10033,51258,'1987-03-18','1988-03-17'),
(10033,54972,'1988-03-17','1989-03-17'),
(10033,55410,'1989-03-17','1990-03-17'),
(10033,56095,'1990-03-17','1991-03-17'),
(10033,56038,'1991-03-17','1992-03-16'),
(10033,57712,'1992-03-16','1993-03-16'),
(10033,60433,'1993-03-16','1993-03-24'),
(10034,47561,'1995-04-12','1996-04-11'),
(10034,51192,'1996-04-11','1997-04-11'),
(10034,52687,'1997-04-11','1998-04-11'),
(10034,53112,'1998-04-11','1999-04-11'),
(10034,53164,'1999-04-11','1999-10-31'),
(10035,41538,'1988-09-05','1989-09-05'),
(10035,45131,'1989-09-05','1990-09-05'),
(10035,45629,'1990-09-05','1991-09-05'),
(10035,48360,'1991-09-05','1992-09-04'),
(10035,50664,'1992-09-04','1993-09-04'),
(10035,53060,'1993-09-04','1994-09-04'),
(10035,56640,'1994-09-04','1995-09-04'),
(10035,57621,'1995-09-04','1996-09-03'),
(10035,59291,'1996-09-03','1997-09-03'),
(10035,61793,'1997-09-03','1998-09-03'),
(10035,62285,'1998-09-03','1999-09-03'),
(10035,65332,'1999-09-03','2000-09-02'),
(10035,66584,'2000-09-02','2001-09-02'),
(10035,68755,'2001-09-02','9999-01-01'),
(10036,42819,'1992-04-28','1993-04-28'),
(10036,46756,'1993-04-28','1994-04-28'),
(10036,51084,'1994-04-28','1995-04-28'),
(10036,52308,'1995-04-28','1996-04-27'),
(10036,53828,'1996-04-27','1997-04-27'),
(10036,54408,'1997-04-27','1998-04-27'),
(10036,53929,'1998-04-27','1999-04-27'),
(10036,56579,'1999-04-27','2000-04-26'),
(10036,60478,'2000-04-26','2001-04-26'),
(10036,60520,'2001-04-26','2002-04-26'),
(10036,63053,'2002-04-26','9999-01-01');

 * sqlite://
337 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM salaries LIMIT 5;

 * sqlite://
Done.

[(10001, 60117, '1986-06-26', '1987-06-26'),
 (10001, 62102, '1987-06-26', '1988-06-25'),
 (10001, 66074, '1988-06-25', '1989-06-25'),
 (10001, 66596, '1989-06-25', '1990-06-25'),
 (10001, 66961, '1990-06-25', '1991-06-25')]

### Statistics

* https://www1.udel.edu/evelyn/SQL-Class3/SQL3_Stat.html
* https://www.statology.org/convert-z-scores-percentiles-excel/

In [ ]:
%%sql
SELECT salaries.emp_no, Count(*) AS Frequency
FROM salaries
GROUP BY salaries.emp_no
ORDER BY Count(*) DESC, emp_no LIMIT 5;

 * sqlite://
Done.

[(10009, 18), (10001, 17), (10013, 17), (10004, 16), (10018, 16)]

In [ ]:
%%sql
SELECT emp_no, Count(*) AS Frequency
FROM salaries
GROUP BY emp_no
HAVING Count(*) >= (
  SELECT Count(*)
  FROM salaries
  GROUP BY emp_no);

 * sqlite://
Done.

[(10001, 17), (10009, 18), (10013, 17)]

In [ ]:
%%sql
CREATE TEMPORARY TABLE temp_sal AS
  SELECT emp_no, MAX(salary) as salary
  FROM salaries
  GROUP BY emp_no;

 * sqlite://
Done.

[]

In [ ]:
%%sql
SELECT * FROM temp_sal LIMIT 5;

 * sqlite://
Done.

[(10001, 88958),
 (10002, 72527),
 (10003, 43699),
 (10004, 74057),
 (10005, 94692)]

In [ ]:
%%sql
SELECT s1.emp_no as EmpNo, Count(s1.emp_no) as Frequency, s1.salary
FROM temp_sal as s1
  INNER JOIN temp_sal as s2
  ON s1.salary >= s2.salary
GROUP BY s1.emp_no
ORDER BY s1.salary DESC
LIMIT 5;

 * sqlite://
Done.

[(10017, 36, 99651),
 (10024, 35, 96646),
 (10005, 34, 94692),
 (10009, 33, 94443),
 (10001, 32, 88958)]

In [ ]:
%%sql
SELECT Avg(salary) as MedianSalary FROM
  (SELECT s1.emp_no as EmpNo, Count(s1.emp_no) as Frequency, s1.salary
  FROM temp_sal as s1
    INNER JOIN temp_sal as s2
    ON s1.salary >= s2.salary
  GROUP BY s1.emp_no
  HAVING Count(s1.emp_no)
    BETWEEN (SELECT (Count(emp_no)/2)-0.5 FROM temp_sal)
    AND (SELECT (Count(emp_no)/2)+0.5 FROM temp_sal)
  ORDER BY s1.salary);

 * sqlite://
Done.

[(63053.0,)]

### Employees DB

* https://github.com/fracpete/employees-db-sqlite
* https://www3.ntu.edu.sg/home/ehchua/programming/sql/SampleDatabases.html
* https://dev.mysql.com/doc/employee/en/employees-installation.html
* https://github.com/datacharmer/test_db
* https://dev.mysql.com/doc/employee/en/sakila-structure.html

In [ ]:
!gunzip "/content/drive/MyDrive/INFO4080/employees_db-full-1.0.6.db.gz"

gzip: /content/drive/MyDrive/INFO4080/ is a directory -- ignored

In [ ]:
# mount drive
!gunzip "/content/drive/MyDrive/INFO4080/employees_db-full-1.0.6.db.gz" "/content/drive/MyDrive/INFO4080/"

In [ ]:
import sqlite3

connection = sqlite3.connect('/content/drive/MyDrive/INFO4080/employees_db-full-1.0.6.db')
cursor = connection.cursor()

In [ ]:
results = cursor.execute("SELECT * FROM salaries LIMIT 5").fetchall()
print([d[0] for d in cursor.description])
for record in results:
  print(record)

['emp_no', 'salary', 'from_date', 'to_date']
(10001, 60117, '1986-06-26', '1987-06-26')
(10001, 62102, '1987-06-26', '1988-06-25')
(10001, 66074, '1988-06-25', '1989-06-25')
(10001, 66596, '1989-06-25', '1990-06-25')
(10001, 66961, '1990-06-25', '1991-06-25')

### Normal Curve

* https://exceljet.net/functions/norm.s.dist-function
*

## LLM Applications

Sources:
* https://youtu.be/5sLYAQS9sWQ?si=GvUPLrky1aNV83pa
* https://youtu.be/osKyvYJ3PRM?si=1t1oVzGsNMC528V1
* https://huggingface.co/docs/transformers/en/training

### WikiScrape Word Embedding

* Word Embedding Notebook

The format might look like a list of dictionaries:

    [{"fulltext": "some prompt string","summary":"the best completed text option given the prompt"},]

In [ ]:
# import pandas as pd

# df = pd.read_csv('file.csv')

In [ ]:
# # create json format
# fulltext = df['txt']
# ft_format = [{"fulltext" : f, "summary": f} for f, s in zip(fulltext, summary)]

In [ ]:
# # example
# print(len(ft_format))
# ft_format[0]

In [ ]:
# # list to json
# import json

# training_data = json.dumps(ft_format, indent=2)

## Text to SQL

Sources

* OpenAI with Python API Bootcamp by Jose Portilla
* https://www.youtube.com/watch?v=yBI1nPep72Q
* https://github.com/danielsobrado/llm_notebooks
* https://llm.extractum.io/

### Terms

* Model Quantization is a technique used to reduce the size of large neural networks, including large language models (LLMs) by modifying the precision of their weights. LLM Quantization is enabled thanks to empiric results showing that while some operations related to neural network training and inference must leverage high precision, in some cases it's possible to use significantly lower precision (float16 for example) reducing the overall size of the model, allowing it to be run using less powerful hardware with an acceptable reduction of its capabilities and accuracy.
* Retrieval-augmented generation (RAG) is a technique for enhancing the accuracy and reliability of generative AI models with facts fetched from external sources.

Sources

* https://blogs.nvidia.com/blog/what-is-retrieval-augmented-generation/
* https://deci.ai/quantization-and-quantization-aware-training/
* https://www.tensorops.ai/post/what-are-quantized-llms

### SQL

* SQL is meant to work with SQL compatible applications
* There are many other options to work with tabular data like Excel or CSV
* Pandas allows us to work with tabular data sources such as SQL

In [ ]:
# convert csv from pandas to sql
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/gitmystuff/Datasets/main/Auto.csv')
print(df.shape)
print(df.info())
df.head()

(397, 9)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           397 non-null    float64
 1   cylinders     397 non-null    int64
 2   displacement  397 non-null    float64
 3   horsepower    397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.0+ KB
None

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [ ]:
# pandas groupby example
df['origin'] = df['origin'].astype('object')
df.groupby('origin')['mpg'].mean()

origin
1    20.071774
2    27.891429
3    30.450633
Name: mpg, dtype: float64

In [ ]:
# pandas to sql
# what is the average mpg for the origin of cars
# --> SELECT AVG(mpg) FROM table GROUP BY ...
from sqlalchemy import create_engine, text

db = create_engine('sqlite:///:memory', echo=True)

data = df.to_sql(name='MPG', con=db)

2024-04-25 17:17:58,431 INFO sqlalchemy.engine.Engine BEGIN (implicit)

INFO:sqlalchemy.engine.Engine:BEGIN (implicit)

2024-04-25 17:17:58,443 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("MPG")

INFO:sqlalchemy.engine.Engine:PRAGMA main.table_info("MPG")

2024-04-25 17:17:58,447 INFO sqlalchemy.engine.Engine [raw sql] ()

INFO:sqlalchemy.engine.Engine:[raw sql] ()

2024-04-25 17:17:58,462 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("MPG")

INFO:sqlalchemy.engine.Engine:PRAGMA temp.table_info("MPG")

2024-04-25 17:17:58,468 INFO sqlalchemy.engine.Engine [raw sql] ()

INFO:sqlalchemy.engine.Engine:[raw sql] ()

2024-04-25 17:17:58,474 INFO sqlalchemy.engine.Engine
CREATE TABLE "MPG" (
	"index" BIGINT,
	mpg FLOAT,
	cylinders BIGINT,
	displacement FLOAT,
	horsepower TEXT,
	weight BIGINT,
	acceleration FLOAT,
	year BIGINT,
	origin BIGINT,
	name TEXT
)

INFO:sqlalchemy.engine.Engine:
CREATE TABLE "MPG" (
	"index" BIGINT,
	mpg FLOAT,
	cylinders BIGINT,
	displacement FLOAT,
	horsepower TEXT,
	weight BIGINT,
	acceleration FLOAT,
	year BIGINT,
	origin BIGINT,
	name TEXT
)

2024-04-25 17:17:58,478 INFO sqlalchemy.engine.Engine [no key 0.00343s] ()

INFO:sqlalchemy.engine.Engine:[no key 0.00343s] ()

2024-04-25 17:17:58,493 INFO sqlalchemy.engine.Engine CREATE INDEX "ix_MPG_index" ON "MPG" ("index")

INFO:sqlalchemy.engine.Engine:CREATE INDEX "ix_MPG_index" ON "MPG" ("index")

2024-04-25 17:17:58,502 INFO sqlalchemy.engine.Engine [no key 0.00929s] ()

INFO:sqlalchemy.engine.Engine:[no key 0.00929s] ()

2024-04-25 17:17:58,528 INFO sqlalchemy.engine.Engine INSERT INTO "MPG" ("index", mpg, cylinders, displacement, horsepower, weight, acceleration, year, origin, name) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

INFO:sqlalchemy.engine.Engine:INSERT INTO "MPG" ("index", mpg, cylinders, displacement, horsepower, weight, acceleration, year, origin, name) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

2024-04-25 17:17:58,532 INFO sqlalchemy.engine.Engine [generated in 0.00856s] [(0, 18.0, 8, 307.0, '130', 3504, 12.0, 70, 1, 'chevrolet chevelle malibu'), (1, 15.0, 8, 350.0, '165', 3693, 11.5, 70, 1, 'buick skylark 320'), (2, 18.0, 8, 318.0, '150', 3436, 11.0, 70, 1, 'plymouth satellite'), (3, 16.0, 8, 304.0, '150', 3433, 12.0, 70, 1, 'amc rebel sst'), (4, 17.0, 8, 302.0, '140', 3449, 10.5, 70, 1, 'ford torino'), (5, 15.0, 8, 429.0, '198', 4341, 10.0, 70, 1, 'ford galaxie 500'), (6, 14.0, 8, 454.0, '220', 4354, 9.0, 70, 1, 'chevrolet impala'), (7, 14.0, 8, 440.0, '215', 4312, 8.5, 70, 1, 'plymouth fury iii')  ... displaying 10 of 397 total bound parameter sets ...  (395, 28.0, 4, 120.0, '79', 2625, 18.6, 82, 1, 'ford ranger'), (396, 31.0, 4, 119.0, '82', 2720, 19.4, 82, 1, 'chevy s-10')]

INFO:sqlalchemy.engine.Engine:[generated in 0.00856s] [(0, 18.0, 8, 307.0, '130', 3504, 12.0, 70, 1, 'chevrolet chevelle malibu'), (1, 15.0, 8, 350.0, '165', 3693, 11.5, 70, 1, 'buick skylark 320'), (2, 18.0, 8, 318.0, '150', 3436, 11.0, 70, 1, 'plymouth satellite'), (3, 16.0, 8, 304.0, '150', 3433, 12.0, 70, 1, 'amc rebel sst'), (4, 17.0, 8, 302.0, '140', 3449, 10.5, 70, 1, 'ford torino'), (5, 15.0, 8, 429.0, '198', 4341, 10.0, 70, 1, 'ford galaxie 500'), (6, 14.0, 8, 454.0, '220', 4354, 9.0, 70, 1, 'chevrolet impala'), (7, 14.0, 8, 440.0, '215', 4312, 8.5, 70, 1, 'plymouth fury iii')  ... displaying 10 of 397 total bound parameter sets ...  (395, 28.0, 4, 120.0, '79', 2625, 18.6, 82, 1, 'ford ranger'), (396, 31.0, 4, 119.0, '82', 2720, 19.4, 82, 1, 'chevy s-10')]

2024-04-25 17:17:58,540 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name

INFO:sqlalchemy.engine.Engine:SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name

2024-04-25 17:17:58,544 INFO sqlalchemy.engine.Engine [raw sql] ()

INFO:sqlalchemy.engine.Engine:[raw sql] ()

2024-04-25 17:17:58,548 INFO sqlalchemy.engine.Engine COMMIT

INFO:sqlalchemy.engine.Engine:COMMIT

In [ ]:
# connect and query
with db.connect() as conn:
  # makes connection, allows queries, and closes
  results = conn.execute(text('SELECT * FROM MPG'))

results.all()

2024-04-25 17:18:02,315 INFO sqlalchemy.engine.Engine BEGIN (implicit)

INFO:sqlalchemy.engine.Engine:BEGIN (implicit)

2024-04-25 17:18:02,321 INFO sqlalchemy.engine.Engine SELECT * FROM MPG

INFO:sqlalchemy.engine.Engine:SELECT * FROM MPG

2024-04-25 17:18:02,323 INFO sqlalchemy.engine.Engine [generated in 0.00753s] ()

INFO:sqlalchemy.engine.Engine:[generated in 0.00753s] ()

2024-04-25 17:18:02,326 INFO sqlalchemy.engine.Engine ROLLBACK

INFO:sqlalchemy.engine.Engine:ROLLBACK

[(0, 18.0, 8, 307.0, '130', 3504, 12.0, 70, 1, 'chevrolet chevelle malibu'),
 (1, 15.0, 8, 350.0, '165', 3693, 11.5, 70, 1, 'buick skylark 320'),
 (2, 18.0, 8, 318.0, '150', 3436, 11.0, 70, 1, 'plymouth satellite'),
 (3, 16.0, 8, 304.0, '150', 3433, 12.0, 70, 1, 'amc rebel sst'),
 (4, 17.0, 8, 302.0, '140', 3449, 10.5, 70, 1, 'ford torino'),
 (5, 15.0, 8, 429.0, '198', 4341, 10.0, 70, 1, 'ford galaxie 500'),
 (6, 14.0, 8, 454.0, '220', 4354, 9.0, 70, 1, 'chevrolet impala'),
 (7, 14.0, 8, 440.0, '215', 4312, 8.5, 70, 1, 'plymouth fury iii'),
 (8, 14.0, 8, 455.0, '225', 4425, 10.0, 70, 1, 'pontiac catalina'),
 (9, 15.0, 8, 390.0, '190', 3850, 8.5, 70, 1, 'amc ambassador dpl'),
 (10, 15.0, 8, 383.0, '170', 3563, 10.0, 70, 1, 'dodge challenger se'),
 (11, 14.0, 8, 340.0, '160', 3609, 8.0, 70, 1, "plymouth 'cuda 340"),
 (12, 15.0, 8, 400.0, '150', 3761, 9.5, 70, 1, 'chevrolet monte carlo'),
 (13, 14.0, 8, 455.0, '225', 3086, 10.0, 70, 1, 'buick estate wagon (sw)'),
 (14, 24.0, 4, 113.0, '95', 2372, 15.0, 70, 3, 'toyota corona mark ii'),
 (15, 22.0, 6, 198.0, '95', 2833, 15.5, 70, 1, 'plymouth duster'),
 (16, 18.0, 6, 199.0, '97', 2774, 15.5, 70, 1, 'amc hornet'),
 (17, 21.0, 6, 200.0, '85', 2587, 16.0, 70, 1, 'ford maverick'),
 (18, 27.0, 4, 97.0, '88', 2130, 14.5, 70, 3, 'datsun pl510'),
 (19, 26.0, 4, 97.0, '46', 1835, 20.5, 70, 2, 'volkswagen 1131 deluxe sedan'),
 (20, 25.0, 4, 110.0, '87', 2672, 17.5, 70, 2, 'peugeot 504'),
 (21, 24.0, 4, 107.0, '90', 2430, 14.5, 70, 2, 'audi 100 ls'),
 (22, 25.0, 4, 104.0, '95', 2375, 17.5, 70, 2, 'saab 99e'),
 (23, 26.0, 4, 121.0, '113', 2234, 12.5, 70, 2, 'bmw 2002'),
 (24, 21.0, 6, 199.0, '90', 2648, 15.0, 70, 1, 'amc gremlin'),
 (25, 10.0, 8, 360.0, '215', 4615, 14.0, 70, 1, 'ford f250'),
 (26, 10.0, 8, 307.0, '200', 4376, 15.0, 70, 1, 'chevy c20'),
 (27, 11.0, 8, 318.0, '210', 4382, 13.5, 70, 1, 'dodge d200'),
 (28, 9.0, 8, 304.0, '193', 4732, 18.5, 70, 1, 'hi 1200d'),
 (29, 27.0, 4, 97.0, '88', 2130, 14.5, 71, 3, 'datsun pl510'),
 (30, 28.0, 4, 140.0, '90', 2264, 15.5, 71, 1, 'chevrolet vega 2300'),
 (31, 25.0, 4, 113.0, '95', 2228, 14.0, 71, 3, 'toyota corona'),
 (32, 25.0, 4, 98.0, '?', 2046, 19.0, 71, 1, 'ford pinto'),
 (33, 19.0, 6, 232.0, '100', 2634, 13.0, 71, 1, 'amc gremlin'),
 (34, 16.0, 6, 225.0, '105', 3439, 15.5, 71, 1, 'plymouth satellite custom'),
 (35, 17.0, 6, 250.0, '100', 3329, 15.5, 71, 1, 'chevrolet chevelle malibu'),
 (36, 19.0, 6, 250.0, '88', 3302, 15.5, 71, 1, 'ford torino 500'),
 (37, 18.0, 6, 232.0, '100', 3288, 15.5, 71, 1, 'amc matador'),
 (38, 14.0, 8, 350.0, '165', 4209, 12.0, 71, 1, 'chevrolet impala'),
 (39, 14.0, 8, 400.0, '175', 4464, 11.5, 71, 1, 'pontiac catalina brougham'),
 (40, 14.0, 8, 351.0, '153', 4154, 13.5, 71, 1, 'ford galaxie 500'),
 (41, 14.0, 8, 318.0, '150', 4096, 13.0, 71, 1, 'plymouth fury iii'),
 (42, 12.0, 8, 383.0, '180', 4955, 11.5, 71, 1, 'dodge monaco (sw)'),
 (43, 13.0, 8, 400.0, '170', 4746, 12.0, 71, 1, 'ford country squire (sw)'),
 (44, 13.0, 8, 400.0, '175', 5140, 12.0, 71, 1, 'pontiac safari (sw)'),
 (45, 18.0, 6, 258.0, '110', 2962, 13.5, 71, 1, 'amc hornet sportabout (sw)'),
 (46, 22.0, 4, 140.0, '72', 2408, 19.0, 71, 1, 'chevrolet vega (sw)'),
 (47, 19.0, 6, 250.0, '100', 3282, 15.0, 71, 1, 'pontiac firebird'),
 (48, 18.0, 6, 250.0, '88', 3139, 14.5, 71, 1, 'ford mustang'),
 (49, 23.0, 4, 122.0, '86', 2220, 14.0, 71, 1, 'mercury capri 2000'),
 (50, 28.0, 4, 116.0, '90', 2123, 14.0, 71, 2, 'opel 1900'),
 (51, 30.0, 4, 79.0, '70', 2074, 19.5, 71, 2, 'peugeot 304'),
 (52, 30.0, 4, 88.0, '76', 2065, 14.5, 71, 2, 'fiat 124b'),
 (53, 31.0, 4, 71.0, '65', 1773, 19.0, 71, 3, 'toyota corolla 1200'),
 (54, 35.0, 4, 72.0, '69', 1613, 18.0, 71, 3, 'datsun 1200'),
 (55, 27.0, 4, 97.0, '60', 1834, 19.0, 71, 2, 'volkswagen model 111'),
 (56, 26.0, 4, 91.0, '70', 1955, 20.5, 71, 1, 'plymouth cricket'),
 (57, 24.0, 4, 113.0, '95', 2278, 15.5, 72, 3, 'toyota corona hardtop'),
 (58, 25.0, 4, 97.5, '80', 2126, 17.0, 72, 1, 'dodge colt hardtop'),
 (59, 23.0, 4, 97.0, '54', 2254, 23.5, 72, 2, 'volkswagen type 3'),
 (60, 20.0, 4, 140.0, '90', 2408, 19.5, 72, 1, 'chevrolet vega'),
 (61, 21.0, 4, 122.0, '86', 2226, 16.5, 72, 1, 'ford pinto runabout'),
 (62, 13.0, 8, 350.0, '165', 4274, 12.0, 72, 1, 'chevrolet impala'),
 (63, 14.0, 8, 400.0, '175', 4385, 12.0, 72, 1, 'pontiac catalina'),
 (64, 15.0, 8, 318.0, '150', 4135, 13.5, 72, 1, 'plymouth fury iii'),
 (65, 14.0, 8, 351.0, '153', 4129, 13.0, 72, 1, 'ford galaxie 500'),
 (66, 17.0, 8, 304.0, '150', 3672, 11.5, 72, 1, 'amc ambassador sst'),
 (67, 11.0, 8, 429.0, '208', 4633, 11.0, 72, 1, 'mercury marquis'),
 (68, 13.0, 8, 350.0, '155', 4502, 13.5, 72, 1, 'buick lesabre custom'),
 (69, 12.0, 8, 350.0, '160', 4456, 13.5, 72, 1, 'oldsmobile delta 88 royale'),
 (70, 13.0, 8, 400.0, '190', 4422, 12.5, 72, 1, 'chrysler newport royal'),
 (71, 19.0, 3, 70.0, '97', 2330, 13.5, 72, 3, 'mazda rx2 coupe'),
 (72, 15.0, 8, 304.0, '150', 3892, 12.5, 72, 1, 'amc matador (sw)'),
 (73, 13.0, 8, 307.0, '130', 4098, 14.0, 72, 1, 'chevrolet chevelle concours (sw)'),
 (74, 13.0, 8, 302.0, '140', 4294, 16.0, 72, 1, 'ford gran torino (sw)'),
 (75, 14.0, 8, 318.0, '150', 4077, 14.0, 72, 1, 'plymouth satellite custom (sw)'),
 (76, 18.0, 4, 121.0, '112', 2933, 14.5, 72, 2, 'volvo 145e (sw)'),
 (77, 22.0, 4, 121.0, '76', 2511, 18.0, 72, 2, 'volkswagen 411 (sw)'),
 (78, 21.0, 4, 120.0, '87', 2979, 19.5, 72, 2, 'peugeot 504 (sw)'),
 (79, 26.0, 4, 96.0, '69', 2189, 18.0, 72, 2, 'renault 12 (sw)'),
 (80, 22.0, 4, 122.0, '86', 2395, 16.0, 72, 1, 'ford pinto (sw)'),
 (81, 28.0, 4, 97.0, '92', 2288, 17.0, 72, 3, 'datsun 510 (sw)'),
 (82, 23.0, 4, 120.0, '97', 2506, 14.5, 72, 3, 'toyouta corona mark ii (sw)'),
 (83, 28.0, 4, 98.0, '80', 2164, 15.0, 72, 1, 'dodge colt (sw)'),
 (84, 27.0, 4, 97.0, '88', 2100, 16.5, 72, 3, 'toyota corolla 1600 (sw)'),
 (85, 13.0, 8, 350.0, '175', 4100, 13.0, 73, 1, 'buick century 350'),
 (86, 14.0, 8, 304.0, '150', 3672, 11.5, 73, 1, 'amc matador'),
 (87, 13.0, 8, 350.0, '145', 3988, 13.0, 73, 1, 'chevrolet malibu'),
 (88, 14.0, 8, 302.0, '137', 4042, 14.5, 73, 1, 'ford gran torino'),
 (89, 15.0, 8, 318.0, '150', 3777, 12.5, 73, 1, 'dodge coronet custom'),
 (90, 12.0, 8, 429.0, '198', 4952, 11.5, 73, 1, 'mercury marquis brougham'),
 (91, 13.0, 8, 400.0, '150', 4464, 12.0, 73, 1, 'chevrolet caprice classic'),
 (92, 13.0, 8, 351.0, '158', 4363, 13.0, 73, 1, 'ford ltd'),
 (93, 14.0, 8, 318.0, '150', 4237, 14.5, 73, 1, 'plymouth fury gran sedan'),
 (94, 13.0, 8, 440.0, '215', 4735, 11.0, 73, 1, 'chrysler new yorker brougham'),
 (95, 12.0, 8, 455.0, '225', 4951, 11.0, 73, 1, 'buick electra 225 custom'),
 (96, 13.0, 8, 360.0, '175', 3821, 11.0, 73, 1, 'amc ambassador brougham'),
 (97, 18.0, 6, 225.0, '105', 3121, 16.5, 73, 1, 'plymouth valiant'),
 (98, 16.0, 6, 250.0, '100', 3278, 18.0, 73, 1, 'chevrolet nova custom'),
 (99, 18.0, 6, 232.0, '100', 2945, 16.0, 73, 1, 'amc hornet'),
 (100, 18.0, 6, 250.0, '88', 3021, 16.5, 73, 1, 'ford maverick'),
 (101, 23.0, 6, 198.0, '95', 2904, 16.0, 73, 1, 'plymouth duster'),
 (102, 26.0, 4, 97.0, '46', 1950, 21.0, 73, 2, 'volkswagen super beetle'),
 (103, 11.0, 8, 400.0, '150', 4997, 14.0, 73, 1, 'chevrolet impala'),
 (104, 12.0, 8, 400.0, '167', 4906, 12.5, 73, 1, 'ford country'),
 (105, 13.0, 8, 360.0, '170', 4654, 13.0, 73, 1, 'plymouth custom suburb'),
 (106, 12.0, 8, 350.0, '180', 4499, 12.5, 73, 1, 'oldsmobile vista cruiser'),
 (107, 18.0, 6, 232.0, '100', 2789, 15.0, 73, 1, 'amc gremlin'),
 (108, 20.0, 4, 97.0, '88', 2279, 19.0, 73, 3, 'toyota carina'),
 (109, 21.0, 4, 140.0, '72', 2401, 19.5, 73, 1, 'chevrolet vega'),
 (110, 22.0, 4, 108.0, '94', 2379, 16.5, 73, 3, 'datsun 610'),
 (111, 18.0, 3, 70.0, '90', 2124, 13.5, 73, 3, 'maxda rx3'),
 (112, 19.0, 4, 122.0, '85', 2310, 18.5, 73, 1, 'ford pinto'),
 (113, 21.0, 6, 155.0, '107', 2472, 14.0, 73, 1, 'mercury capri v6'),
 (114, 26.0, 4, 98.0, '90', 2265, 15.5, 73, 2, 'fiat 124 sport coupe'),
 (115, 15.0, 8, 350.0, '145', 4082, 13.0, 73, 1, 'chevrolet monte carlo s'),
 (116, 16.0, 8, 400.0, '230', 4278, 9.5, 73, 1, 'pontiac grand prix'),
 (117, 29.0, 4, 68.0, '49', 1867, 19.5, 73, 2, 'fiat 128'),
 (118, 24.0, 4, 116.0, '75', 2158, 15.5, 73, 2, 'opel manta'),
 (119, 20.0, 4, 114.0, '91', 2582, 14.0, 73, 2, 'audi 100ls'),
 (120, 19.0, 4, 121.0, '112', 2868, 15.5, 73, 2, 'volvo 144ea'),
 (121, 15.0, 8, 318.0, '150', 3399, 11.0, 73, 1, 'dodge dart custom'),
 (122, 24.0, 4, 121.0, '110', 2660, 14.0, 73, 2, 'saab 99le'),
 (123, 20.0, 6, 156.0, '122', 2807, 13.5, 73, 3, 'toyota mark ii'),
 (124, 11.0, 8, 350.0, '180', 3664, 11.0, 73, 1, 'oldsmobile omega'),
 (125, 20.0, 6, 198.0, '95', 3102, 16.5, 74, 1, 'plymouth duster'),
 (126, 21.0, 6, 200.0, '?', 2875, 17.0, 74, 1, 'ford maverick'),
 (127, 19.0, 6, 232.0, '100', 2901, 16.0, 74, 1, 'amc hornet'),
 (128, 15.0, 6, 250.0, '100', 3336, 17.0, 74, 1, 'chevrolet nova'),
 (129, 31.0, 4, 79.0, '67', 1950, 19.0, 74, 3, 'datsun b210'),
 (130, 26.0, 4, 122.0, '80', 2451, 16.5, 74, 1, 'ford pinto'),
 (131, 32.0, 4, 71.0, '65', 1836, 21.0, 74, 3, 'toyota corolla 1200'),
 (132, 25.0, 4, 140.0, '75', 2542, 17.0, 74, 1, 'chevrolet vega'),
 (133, 16.0, 6, 250.0, '100', 3781, 17.0, 74, 1, 'chevrolet chevelle malibu classic'),
 (134, 16.0, 6, 258.0, '110', 3632, 18.0, 74, 1, 'amc matador'),
 (135, 18.0, 6, 225.0, '105', 3613, 16.5, 74, 1, 'plymouth satellite sebring'),
 (136, 16.0, 8, 302.0, '140', 4141, 14.0, 74, 1, 'ford gran torino'),
 (137, 13.0, 8, 350.0, '150', 4699, 14.5, 74, 1, 'buick century luxus (sw)'),
 (138, 14.0, 8, 318.0, '150', 4457, 13.5, 74, 1, 'dodge coronet custom (sw)'),
 (139, 14.0, 8, 302.0, '140', 4638, 16.0, 74, 1, 'ford gran torino (sw)'),
 (140, 14.0, 8, 304.0, '150', 4257, 15.5, 74, 1, 'amc matador (sw)'),
 (141, 29.0, 4, 98.0, '83', 2219, 16.5, 74, 2, 'audi fox'),
 (142, 26.0, 4, 79.0, '67', 1963, 15.5, 74, 2, 'volkswagen dasher'),
 (143, 26.0, 4, 97.0, '78', 2300, 14.5, 74, 2, 'opel manta'),
 (144, 31.0, 4, 76.0, '52', 1649, 16.5, 74, 3, 'toyota corona'),
 (145, 32.0, 4, 83.0, '61', 2003, 19.0, 74, 3, 'datsun 710'),
 (146, 28.0, 4, 90.0, '75', 2125, 14.5, 74, 1, 'dodge colt'),
 (147, 24.0, 4, 90.0, '75', 2108, 15.5, 74, 2, 'fiat 128'),
 (148, 26.0, 4, 116.0, '75', 2246, 14.0, 74, 2, 'fiat 124 tc'),
 (149, 24.0, 4, 120.0, '97', 2489, 15.0, 74, 3, 'honda civic'),
 (150, 26.0, 4, 108.0, '93', 2391, 15.5, 74, 3, 'subaru'),
 (151, 31.0, 4, 79.0, '67', 2000, 16.0, 74, 2, 'fiat x1.9'),
 (152, 19.0, 6, 225.0, '95', 3264, 16.0, 75, 1, 'plymouth valiant custom'),
 (153, 18.0, 6, 250.0, '105', 3459, 16.0, 75, 1, 'chevrolet nova'),
 (154, 15.0, 6, 250.0, '72', 3432, 21.0, 75, 1, 'mercury monarch'),
 (155, 15.0, 6, 250.0, '72', 3158, 19.5, 75, 1, 'ford maverick'),
 (156, 16.0, 8, 400.0, '170', 4668, 11.5, 75, 1, 'pontiac catalina'),
 (157, 15.0, 8, 350.0, '145', 4440, 14.0, 75, 1, 'chevrolet bel air'),
 (158, 16.0, 8, 318.0, '150', 4498, 14.5, 75, 1, 'plymouth grand fury'),
 (159, 14.0, 8, 351.0, '148', 4657, 13.5, 75, 1, 'ford ltd'),
 (160, 17.0, 6, 231.0, '110', 3907, 21.0, 75, 1, 'buick century'),
 (161, 16.0, 6, 250.0, '105', 3897, 18.5, 75, 1, 'chevroelt chevelle malibu'),
 (162, 15.0, 6, 258.0, '110', 3730, 19.0, 75, 1, 'amc matador'),
 (163, 18.0, 6, 225.0, '95', 3785, 19.0, 75, 1, 'plymouth fury'),
 (164, 21.0, 6, 231.0, '110', 3039, 15.0, 75, 1, 'buick skyhawk'),
 (165, 20.0, 8, 262.0, '110', 3221, 13.5, 75, 1, 'chevrolet monza 2+2'),
 (166, 13.0, 8, 302.0, '129', 3169, 12.0, 75, 1, 'ford mustang ii'),
 (167, 29.0, 4, 97.0, '75', 2171, 16.0, 75, 3, 'toyota corolla'),
 (168, 23.0, 4, 140.0, '83', 2639, 17.0, 75, 1, 'ford pinto'),
 (169, 20.0, 6, 232.0, '100', 2914, 16.0, 75, 1, 'amc gremlin'),
 (170, 23.0, 4, 140.0, '78', 2592, 18.5, 75, 1, 'pontiac astro'),
 (171, 24.0, 4, 134.0, '96', 2702, 13.5, 75, 3, 'toyota corona'),
 (172, 25.0, 4, 90.0, '71', 2223, 16.5, 75, 2, 'volkswagen dasher'),
 (173, 24.0, 4, 119.0, '97', 2545, 17.0, 75, 3, 'datsun 710'),
 (174, 18.0, 6, 171.0, '97', 2984, 14.5, 75, 1, 'ford pinto'),
 (175, 29.0, 4, 90.0, '70', 1937, 14.0, 75, 2, 'volkswagen rabbit'),
 (176, 19.0, 6, 232.0, '90', 3211, 17.0, 75, 1, 'amc pacer'),
 (177, 23.0, 4, 115.0, '95', 2694, 15.0, 75, 2, 'audi 100ls'),
 (178, 23.0, 4, 120.0, '88', 2957, 17.0, 75, 2, 'peugeot 504'),
 (179, 22.0, 4, 121.0, '98', 2945, 14.5, 75, 2, 'volvo 244dl'),
 (180, 25.0, 4, 121.0, '115', 2671, 13.5, 75, 2, 'saab 99le'),
 (181, 33.0, 4, 91.0, '53', 1795, 17.5, 75, 3, 'honda civic cvcc'),
 (182, 28.0, 4, 107.0, '86', 2464, 15.5, 76, 2, 'fiat 131'),
 (183, 25.0, 4, 116.0, '81', 2220, 16.9, 76, 2, 'opel 1900'),
 (184, 25.0, 4, 140.0, '92', 2572, 14.9, 76, 1, 'capri ii'),
 (185, 26.0, 4, 98.0, '79', 2255, 17.7, 76, 1, 'dodge colt'),
 (186, 27.0, 4, 101.0, '83', 2202, 15.3, 76, 2, 'renault 12tl'),
 (187, 17.5, 8, 305.0, '140', 4215, 13.0, 76, 1, 'chevrolet chevelle malibu classic'),
 (188, 16.0, 8, 318.0, '150', 4190, 13.0, 76, 1, 'dodge coronet brougham'),
 (189, 15.5, 8, 304.0, '120', 3962, 13.9, 76, 1, 'amc matador'),
 (190, 14.5, 8, 351.0, '152', 4215, 12.8, 76, 1, 'ford gran torino'),
 (191, 22.0, 6, 225.0, '100', 3233, 15.4, 76, 1, 'plymouth valiant'),
 (192, 22.0, 6, 250.0, '105', 3353, 14.5, 76, 1, 'chevrolet nova'),
 (193, 24.0, 6, 200.0, '81', 3012, 17.6, 76, 1, 'ford maverick'),
 (194, 22.5, 6, 232.0, '90', 3085, 17.6, 76, 1, 'amc hornet'),
 (195, 29.0, 4, 85.0, '52', 2035, 22.2, 76, 1, 'chevrolet chevette'),
 (196, 24.5, 4, 98.0, '60', 2164, 22.1, 76, 1, 'chevrolet woody'),
 (197, 29.0, 4, 90.0, '70', 1937, 14.2, 76, 2, 'vw rabbit'),
 (198, 33.0, 4, 91.0, '53', 1795, 17.4, 76, 3, 'honda civic'),
 (199, 20.0, 6, 225.0, '100', 3651, 17.7, 76, 1, 'dodge aspen se'),
 (200, 18.0, 6, 250.0, '78', 3574, 21.0, 76, 1, 'ford granada ghia'),
 (201, 18.5, 6, 250.0, '110', 3645, 16.2, 76, 1, 'pontiac ventura sj'),
 (202, 17.5, 6, 258.0, '95', 3193, 17.8, 76, 1, 'amc pacer d/l'),
 (203, 29.5, 4, 97.0, '71', 1825, 12.2, 76, 2, 'volkswagen rabbit'),
 (204, 32.0, 4, 85.0, '70', 1990, 17.0, 76, 3, 'datsun b-210'),
 (205, 28.0, 4, 97.0, '75', 2155, 16.4, 76, 3, 'toyota corolla'),
 (206, 26.5, 4, 140.0, '72', 2565, 13.6, 76, 1, 'ford pinto'),
 (207, 20.0, 4, 130.0, '102', 3150, 15.7, 76, 2, 'volvo 245'),
 (208, 13.0, 8, 318.0, '150', 3940, 13.2, 76, 1, 'plymouth volare premier v8'),
 (209, 19.0, 4, 120.0, '88', 3270, 21.9, 76, 2, 'peugeot 504'),
 (210, 19.0, 6, 156.0, '108', 2930, 15.5, 76, 3, 'toyota mark ii'),
 (211, 16.5, 6, 168.0, '120', 3820, 16.7, 76, 2, 'mercedes-benz 280s'),
 (212, 16.5, 8, 350.0, '180', 4380, 12.1, 76, 1, 'cadillac seville'),
 (213, 13.0, 8, 350.0, '145', 4055, 12.0, 76, 1, 'chevy c10'),
 (214, 13.0, 8, 302.0, '130', 3870, 15.0, 76, 1, 'ford f108'),
 (215, 13.0, 8, 318.0, '150', 3755, 14.0, 76, 1, 'dodge d100'),
 (216, 31.5, 4, 98.0, '68', 2045, 18.5, 77, 3, 'honda accord cvcc'),
 (217, 30.0, 4, 111.0, '80', 2155, 14.8, 77, 1, 'buick opel isuzu deluxe'),
 (218, 36.0, 4, 79.0, '58', 1825, 18.6, 77, 2, 'renault 5 gtl'),
 (219, 25.5, 4, 122.0, '96', 2300, 15.5, 77, 1, 'plymouth arrow gs'),
 (220, 33.5, 4, 85.0, '70', 1945, 16.8, 77, 3, 'datsun f-10 hatchback'),
 (221, 17.5, 8, 305.0, '145', 3880, 12.5, 77, 1, 'chevrolet caprice classic'),
 (222, 17.0, 8, 260.0, '110', 4060, 19.0, 77, 1, 'oldsmobile cutlass supreme'),
 (223, 15.5, 8, 318.0, '145', 4140, 13.7, 77, 1, 'dodge monaco brougham'),
 (224, 15.0, 8, 302.0, '130', 4295, 14.9, 77, 1, 'mercury cougar brougham'),
 (225, 17.5, 6, 250.0, '110', 3520, 16.4, 77, 1, 'chevrolet concours'),
 (226, 20.5, 6, 231.0, '105', 3425, 16.9, 77, 1, 'buick skylark'),
 (227, 19.0, 6, 225.0, '100', 3630, 17.7, 77, 1, 'plymouth volare custom'),
 (228, 18.5, 6, 250.0, '98', 3525, 19.0, 77, 1, 'ford granada'),
 (229, 16.0, 8, 400.0, '180', 4220, 11.1, 77, 1, 'pontiac grand prix lj'),
 (230, 15.5, 8, 350.0, '170', 4165, 11.4, 77, 1, 'chevrolet monte carlo landau'),
 (231, 15.5, 8, 400.0, '190', 4325, 12.2, 77, 1, 'chrysler cordoba'),
 (232, 16.0, 8, 351.0, '149', 4335, 14.5, 77, 1, 'ford thunderbird'),
 (233, 29.0, 4, 97.0, '78', 1940, 14.5, 77, 2, 'volkswagen rabbit custom'),
 (234, 24.5, 4, 151.0, '88', 2740, 16.0, 77, 1, 'pontiac sunbird coupe'),
 (235, 26.0, 4, 97.0, '75', 2265, 18.2, 77, 3, 'toyota corolla liftback'),
 (236, 25.5, 4, 140.0, '89', 2755, 15.8, 77, 1, 'ford mustang ii 2+2'),
 (237, 30.5, 4, 98.0, '63', 2051, 17.0, 77, 1, 'chevrolet chevette'),
 (238, 33.5, 4, 98.0, '83', 2075, 15.9, 77, 1, 'dodge colt m/m'),
 (239, 30.0, 4, 97.0, '67', 1985, 16.4, 77, 3, 'subaru dl'),
 (240, 30.5, 4, 97.0, '78', 2190, 14.1, 77, 2, 'volkswagen dasher'),
 (241, 22.0, 6, 146.0, '97', 2815, 14.5, 77, 3, 'datsun 810'),
 (242, 21.5, 4, 121.0, '110', 2600, 12.8, 77, 2, 'bmw 320i'),
 (243, 21.5, 3, 80.0, '110', 2720, 13.5, 77, 3, 'mazda rx-4'),
 (244, 43.1, 4, 90.0, '48', 1985, 21.5, 78, 2, 'volkswagen rabbit custom diesel'),
 (245, 36.1, 4, 98.0, '66', 1800, 14.4, 78, 1, 'ford fiesta'),
 (246, 32.8, 4, 78.0, '52', 1985, 19.4, 78, 3, 'mazda glc deluxe'),
 (247, 39.4, 4, 85.0, '70', 2070, 18.6, 78, 3, 'datsun b210 gx'),
 (248, 36.1, 4, 91.0, '60', 1800, 16.4, 78, 3, 'honda civic cvcc'),
 (249, 19.9, 8, 260.0, '110', 3365, 15.5, 78, 1, 'oldsmobile cutlass salon brougham'),
 (250, 19.4, 8, 318.0, '140', 3735, 13.2, 78, 1, 'dodge diplomat'),
 (251, 20.2, 8, 302.0, '139', 3570, 12.8, 78, 1, 'mercury monarch ghia'),
 (252, 19.2, 6, 231.0, '105', 3535, 19.2, 78, 1, 'pontiac phoenix lj'),
 (253, 20.5, 6, 200.0, '95', 3155, 18.2, 78, 1, 'chevrolet malibu'),
 (254, 20.2, 6, 200.0, '85', 2965, 15.8, 78, 1, 'ford fairmont (auto)'),
 (255, 25.1, 4, 140.0, '88', 2720, 15.4, 78, 1, 'ford fairmont (man)'),
 (256, 20.5, 6, 225.0, '100', 3430, 17.2, 78, 1, 'plymouth volare'),
 (257, 19.4, 6, 232.0, '90', 3210, 17.2, 78, 1, 'amc concord'),
 (258, 20.6, 6, 231.0, '105', 3380, 15.8, 78, 1, 'buick century special'),
 (259, 20.8, 6, 200.0, '85', 3070, 16.7, 78, 1, 'mercury zephyr'),
 (260, 18.6, 6, 225.0, '110', 3620, 18.7, 78, 1, 'dodge aspen'),
 (261, 18.1, 6, 258.0, '120', 3410, 15.1, 78, 1, 'amc concord d/l'),
 (262, 19.2, 8, 305.0, '145', 3425, 13.2, 78, 1, 'chevrolet monte carlo landau'),
 (263, 17.7, 6, 231.0, '165', 3445, 13.4, 78, 1, 'buick regal sport coupe (turbo)'),
 (264, 18.1, 8, 302.0, '139', 3205, 11.2, 78, 1, 'ford futura'),
 (265, 17.5, 8, 318.0, '140', 4080, 13.7, 78, 1, 'dodge magnum xe'),
 (266, 30.0, 4, 98.0, '68', 2155, 16.5, 78, 1, 'chevrolet chevette'),
 (267, 27.5, 4, 134.0, '95', 2560, 14.2, 78, 3, 'toyota corona'),
 (268, 27.2, 4, 119.0, '97', 2300, 14.7, 78, 3, 'datsun 510'),
 (269, 30.9, 4, 105.0, '75', 2230, 14.5, 78, 1, 'dodge omni'),
 (270, 21.1, 4, 134.0, '95', 2515, 14.8, 78, 3, 'toyota celica gt liftback'),
 (271, 23.2, 4, 156.0, '105', 2745, 16.7, 78, 1, 'plymouth sapporo'),
 (272, 23.8, 4, 151.0, '85', 2855, 17.6, 78, 1, 'oldsmobile starfire sx'),
 (273, 23.9, 4, 119.0, '97', 2405, 14.9, 78, 3, 'datsun 200-sx'),
 (274, 20.3, 5, 131.0, '103', 2830, 15.9, 78, 2, 'audi 5000'),
 (275, 17.0, 6, 163.0, '125', 3140, 13.6, 78, 2, 'volvo 264gl'),
 (276, 21.6, 4, 121.0, '115', 2795, 15.7, 78, 2, 'saab 99gle'),
 (277, 16.2, 6, 163.0, '133', 3410, 15.8, 78, 2, 'peugeot 604sl'),
 (278, 31.5, 4, 89.0, '71', 1990, 14.9, 78, 2, 'volkswagen scirocco'),
 (279, 29.5, 4, 98.0, '68', 2135, 16.6, 78, 3, 'honda accord lx'),
 (280, 21.5, 6, 231.0, '115', 3245, 15.4, 79, 1, 'pontiac lemans v6'),
 (281, 19.8, 6, 200.0, '85', 2990, 18.2, 79, 1, 'mercury zephyr 6'),
 (282, 22.3, 4, 140.0, '88', 2890, 17.3, 79, 1, 'ford fairmont 4'),
 (283, 20.2, 6, 232.0, '90', 3265, 18.2, 79, 1, 'amc concord dl 6'),
 (284, 20.6, 6, 225.0, '110', 3360, 16.6, 79, 1, 'dodge aspen 6'),
 (285, 17.0, 8, 305.0, '130', 3840, 15.4, 79, 1, 'chevrolet caprice classic'),
 (286, 17.6, 8, 302.0, '129', 3725, 13.4, 79, 1, 'ford ltd landau'),
 (287, 16.5, 8, 351.0, '138', 3955, 13.2, 79, 1, 'mercury grand marquis'),
 (288, 18.2, 8, 318.0, '135', 3830, 15.2, 79, 1, 'dodge st. regis'),
 (289, 16.9, 8, 350.0, '155', 4360, 14.9, 79, 1, 'buick estate wagon (sw)'),

In [ ]:
# connect and query
with db.connect() as conn:
  # makes connection, allows queries, and closes
  results = conn.execute(text('SELECT AVG(mpg) FROM MPG GROUP BY origin'))

results.all()

2024-04-25 17:18:06,424 INFO sqlalchemy.engine.Engine BEGIN (implicit)

INFO:sqlalchemy.engine.Engine:BEGIN (implicit)

2024-04-25 17:18:06,431 INFO sqlalchemy.engine.Engine SELECT AVG(mpg) FROM MPG GROUP BY origin

INFO:sqlalchemy.engine.Engine:SELECT AVG(mpg) FROM MPG GROUP BY origin

2024-04-25 17:18:06,436 INFO sqlalchemy.engine.Engine [generated in 0.01171s] ()

INFO:sqlalchemy.engine.Engine:[generated in 0.01171s] ()

2024-04-25 17:18:06,439 INFO sqlalchemy.engine.Engine ROLLBACK

INFO:sqlalchemy.engine.Engine:ROLLBACK

[(20.071774193548382,), (27.891428571428573,), (30.450632911392397,)]

### Natural Language to SQL

* https://huggingface.co/docs/transformers/index
* https://huggingface.co/chatdb/natural-sql-7b

Quasi Code

<pre>
# sqlite SQL tables with properties

MPG (
	index BIGINT,
	mpg FLOAT,
	cylinders BIGINT,
	displacement FLOAT,
	horsepower TEXT,
	weight BIGINT,
	acceleration FLOAT,
	year BIGINT,
	origin BIGINT,
	name TEXT
)

# Start the Query
SELECT
</pre>

In [ ]:
# create helper functions
def create_table(query, name):
  prompt = f'''
  Context:
  I have an sqlite SQL table called {name} with these fields:
  {','.join(str(col) for col in df.columns)}
  Natural Language Request: {query}
  Given this information, please provide an SQL Statement: SELECT
  '''

  return prompt

def user_input():
  nlsql = input('What would you like to know?: ')
  table_name = input('What is the name of the table?: ')
  return f'{nlsql}_{table_name}'

def query_database():
  query = user_input()
  query, name = query.split('_')
  return create_table(query, name) # get the average mpg for each origin

In [ ]:
query_database()

What would you like to know?: get the average mpg for each origin
What is the name of the table?: MPG

'\n  Context:\n  I have an sqlite SQL table called MPG with these fields:\n  mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name\n  Natural Language Request: get the average mpg for each origin\n  Given this information, please provide an SQL Statement: SELECT \n  '

### Completion, Chat, Assistant Models

#### Chat

* Designed for multi-turn conversations with multiple roles
* Maintains conversation context by processing the entire conversation history

#### Completion

* Model generates a response based on a single input prompt
* Text Completion
* Code Completion

#### Reinforcement Learning from Human Feedback (RLHF)

* A machine learning technique that uses human feedback to improve ML models
* RLHF is a key technology for aligning language models with human values and intentions

#### Assistants

* The Assistants API is more suitable for applications with high context, advanced customization, and designed to handle complex queries, despite limitations in the number and sizes of files. The Chat Completions API shines in simpler, scalable applications where each interaction can be managed independently but might fall short in applications requiring complex context management.

Readings

* https://openai.com/research  
* https://medium.com/leniolabs/exploring-openais-apis-assistants-vs-chat-completions-91525f73422c

### Completion Parameters

* Model
* Prompt
* Temperature (higher values will consider less probability returns)
* Max Tokens (token count of your prompt plus max_tokens cannot exceed the model's context length ~ 2048?)
* Top P (nucleus sampling uses the top probability rankings so 0.1 means top 10% probabilities mass, and is either/or with Temperature)
* N (how many completions to generate for each prompt, temperature can lend to different results)
* Frequency Penalty (helps to reduce redundancy)
* Presence Penalty (helps likelihood for new topics / creativity)
* https://platform.openai.com/playground?mode=complete

Readings

* https://platform.openai.com/docs/api-reference/introduction

### Example Client Request in Server Mode

Local Inference Server

<pre>
Server Port: 1234
CORS: OFF
Requesting Queuing: ON
Server Logging: ON
Automatic Prompt Formatting: ON

Start/Stop Server
</pre>

Example Client Request

<pre>
import os
import openai

openai.api_base = 'http://localhost:1234/v1
openai.api_key = '' # not needed

completion = openai.ChatCompletion.create(
  model = 'local-model', # currently unused
  messages = [
    {'role': 'system', 'content': 'Always answer in rhymes.'},
    {'role': 'user', 'content': 'Introduce yourself.'}
  ]
)

print(completion.choices[0].message)
</pre>

In [ ]:
# import os
# import openai

# openai.api_base = 'http://localhost:1234/v1
# openai.api_key = '' # not needed

# response = openai.ChatCompletion.create(
#   model = 'local-model',
#   prompt = query_database(df, nltext),
#   temperature = 0,
#   max_tokens = 150,
#   top_p = 1.0,
#   frequency_penalty = 0,
#   presence_penalty = 0,
#   stop=['#', ';']
#   messages = [
#     {'role': 'system', 'content': 'Always answer in rhymes.'},
#     {'role': 'user', 'content': 'Introduce yourself.'}
#   ]
# )

# print(response.choices[0].text) # response['choices'][0]['text']

# def handle_response(response):
#   query = response['choices'][0]['text']
#   if query.startswith(' '):
#     query = 'SELECT'+query
#   return query

# handle_response(response)

In [ ]:
# with db.connect() as conn:
#   result = conn.execute(text(handle_response(response)))

# result.all()

## APA Research Paper

* Research Paper Notes (Google Docs)
* https://docs.google.com/document/d/1suqhZy3QjZ9elkqz9dVtdBou38RNGjp6yx9u23fWkl4/edit?usp=sharing

### Abstract Section

* ABSTRACT: The abstract needs to provide a brief but comprehensive summary of the contents of your paper.  It provides an overview of the paper and helps readers decide whether to read the full text. Limit your abstract to 250 words.
* https://apastyle.apa.org/instructional-aids/abstract-keywords-guide.pdf

### Introduction Section

* A good introduction will summarize, integrate, and critically evaluate the empirical knowledge in the relevant area(s) in a way that sets the stage for your study and why you conducted it. The introduction starts out broad (but not too broad!) and gets more focused toward the end.

Example Prompt:

My research question is To what extent and through what mechanisms does religion influence the formation and expression of ultra-nationalist ideologies and movements within Western civilization? I need to write an introduction to my research paper. Can you write an opening sentence that clearly conveys the relevance of the following text.

[text]

### Method Section

From Gemini

**Prompt**: I am writing a research paper and want to know what elements go in the method section

**Response**:

**Method**

The method section of your research paper is crucial, as it details how you conducted your research and allows readers to assess its validity and replicability. Here are the key elements you should include:

**1. Research Design:**

* https://library.cityu.edu/researchguides/researchmethods/litreview
* Briefly explain the type of research design you employed (e.g., experiment, survey, case study).
* Justify your choice of design and how it aligns with your research question and objectives.

**2. Participants or Subjects:**

* Describe the characteristics of your participants or subjects, including demographics, selection criteria, and sample size.
* Explain how you recruited participants and ensure ethical considerations were addressed (e.g., informed consent).

**3. Materials and Equipment:**

* List all the materials and equipment used in your research, including specific details like brand names, models, and software versions.
* Describe any specific procedures or preparations undertaken for the materials or equipment.

**4. Procedure:**

* Provide a step-by-step explanation of how you conducted your research, ensuring clarity and conciseness.
* Include details on data collection methods (e.g., surveys, interviews, observations) and any manipulations or interventions involved.
*  If applicable, describe the order of events and any control measures implemented.

**5. Data Analysis:**

* Explain how you analyzed your data, including the specific statistical tests or qualitative analysis methods used.
* Briefly justify your choice of analysis methods and their appropriateness for your research question and data type.

**Additional Considerations:**

* **Ethical Approval:** If your research involved human subjects or animals, mention the ethical approval process and the body that granted approval.
* **Data Management:** Briefly describe how you stored and managed your data throughout the research process.
* **Clarity and Conciseness:** Use clear and concise language, avoiding jargon and unnecessary details.
* **Logical Organization:**  Structure the section logically, often using subheadings to present information in a clear and organized manner.

Remember, the specific elements and level of detail required in your methods section may vary depending on your field of study and specific research question. It's always recommended to consult your research style guide or professor for specific formatting and content requirements.

### Results Section

The results section of a research paper is all about presenting the cold, hard facts unearthed by your research. It acts like a bridge between the methodology you used and what you ultimately discovered. Here are the key points to remember:

* **Focus on Findings:** It presents what you found, sticking to data and observations without interpretation or analysis. Think of it as laying out the evidence.
* **Answer the Question:** The findings should directly address the research question(s) you posed at the outset of the paper.
* **Logical Flow:** Organize your findings in a clear and logical sequence, often mirroring the structure of your methodology.
* **Data Presentation:** Use tables, figures, and charts to effectively showcase your findings. Text descriptions should complement these visuals.
* **Neutral Tone:** Avoid any bias or personal opinions in this section. Maintain a strictly objective and factual approach.
* **Context is Key:** Briefly introduce the results section by reminding the reader of the research problem and the purpose of your study.
* **Only Relevant Findings:** Include data directly connected to your research goals. Avoid cluttering the section with unnecessary details.

Remember, the results section sets the stage for the discussion section, where you'll delve deeper into interpreting the meaning of your findings.

The results section of a research paper is one of the most important parts, and it should only include the findings of the study. The results section should include:

* Data: Data presented in tables, charts, graphs, and other figures
* Contextual analysis: A sentence-based explanation of the meaning of the data
* Secondary findings: Secondary outcomes, subgroup analyses, and more
* Connection to research questions: How the data relates to the research questions

The results section should not attempt to interpret or analyze the findings, only state the facts. The data may be placed into the text or on separate pages at the end of the manuscript.

The results (or findings) section is one of the most important parts of a research paper, in which an author reports the findings of their study in connection to their research question(s). The results section should not attempt to interpret or analyze the findings, only state the facts.

The Results section should include the findings of your study and ONLY the findings of your study. The findings include: Data presented in tables, charts, graphs, and other figures (may be placed into the text or on separate pages at the end of the manuscript) A contextual analysis of this data explaining its meaning in sentence form. All data that corresponds to the central research question(s) All secondary findings (secondary outcomes, subgroup analyses, etc.)

### Discussion Section

* Prompt: Hi, I am writing a APA 7 research paper and want to know the key elements of the discussion section. Please also provide and outline of the APA 7 discussion section.

#### Key Elements of an APA 7 Discussion Section

The discussion section is the heart of your research paper. Here's what you should cover:

* **Interpretation of Findings:** Explain what your results mean in light of your research questions or hypotheses.  Discuss how your findings relate to existing research (mentioned in your literature review).
* **Acknowledge Unexpected Results:**  Address any findings that didn't support your hypotheses.  Discuss possible explanations for these results.
* **Limitations:** Discuss the weaknesses or limitations of your study.  How might these limitations have affected your results?
* **Implications:**  Explain the broader significance of your research.  What are the real-world implications of your findings?
* **Future Directions:**  Propose areas for future research based on your findings.  What questions remain unanswered?

####  Outline of an APA 7 Discussion Section

1. **Brief Re-state the Research Question/Hypothesis:**  Remind the reader of your research goals.
2. **Summarize Key Findings:** Briefly mention the main results of your study.
3. **Interpret Findings in Detail:**  Dive deeper into your results, explaining their meaning and how they relate to your research questions/hypotheses and the existing literature.
    * Discuss any unexpected findings and offer possible explanations.
4. **Limitations:** Acknowledge the weaknesses of your study and how they might have affected your results.
5. **Implications:**  Explain the broader significance of your research.  What are the real-world implications of your findings?
6. **Future Directions:**  Propose new research questions or areas for future investigation based on your findings.
7. **Conclusion:**   Briefly summarize the main points of your discussion and reiterate the significance of your research.

**Tips:**

* Use the present tense to discuss your findings.
*  Cite relevant sources throughout the discussion to support your interpretations.
* Maintain a formal and objective writing style.

### References

* https://apastyle.apa.org/style-grammar-guidelines/references/lists-vs-bibliographies
* Use a tool such as MyBib to collect references using APA 7 style (hanging indent) and copy paste into the References section

## PowerPoint Presentation

* https://docs.google.com/document/d/1onb_1KS8RCDc2McbCDp1IewIXg47uwi1URTgDZFcLQY/edit?usp=sharing

## Github Pages